[
  {
    "extract_pdf": {
      "pdf_path": "C:/Users/Yi/OneDrive/Desktop/UChicago25Spring/FinAgent/goog-10-q-q1-2025.pdf",
      "income_text": "Table of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share amounts; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nRevenues $ 80,539 $ 90,234\nCosts and expenses:\nCost of revenues 33,712 36,361\nResearch and development 11,903 13,556\nSales and marketing 6,426 6,172\nGeneral and administrative 3,026 3,539\nTotal costs and expenses 55,067 59,628\nIncome from operations 25,472 30,606\nOther income (expense), net 2,843 11,183\nIncome before income taxes 28,315 41,789\nProvision for income taxes 4,653 7,249\nNet income $ 23,662 $ 34,540\nBasic net income per share (Note 12) $ 1.91 $ 2.84\nDiluted net income per share (Note 12) $ 1.89 $ 2.81\nSee accompanying notes.\n6\nTable of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nNet income $ 23,662 $ 34,540\nOther comprehensive income (loss):\nChange in foreign currency translation adjustment, net of income tax benefit\n(expense) of $(18) and $45 (503) 663\nAvailable-for-sale investments:\nChange in net unrealized gains (losses) (360) 645\nLess: reclassification adjustment for net (gains) losses included in net\nincome 311 (84)\nNet change, net of income tax benefit (expense) of $14 and $(159) (49) 561\nCash flow hedges:\nChange in net unrealized gains (losses) 186 (313)\nLess: reclassification adjustment for net (gains) losses included in net\nincome (71) (197)\nNet change, net of income tax benefit (expense) of $(23) and $131 115 (510)\nOther comprehensive income (loss) (437) 714\nComprehensive income $ 23,225 $ 35,254\nSee accompanying notes.\n7",
      "cashflow_text": "Table of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nOperating activities\nNet income $ 23,662 $ 34,540\nAdjustments:\nDepreciation of property and equipment 3,413 4,487\nStock-based compensation expense 5,264 5,516\nDeferred income taxes 419 (1,152)\nLoss (gain) on debt and equity securities, net (1,781) (9,960)\nOther 334 481\nChanges in assets and liabilities, net of effects of acquisitions:\nAccounts receivable, net 3,167 1,638\nIncome taxes, net 3,011 7,197\nOther assets (1,000) (1,288)\nAccounts payable (2,124) (880)\nAccrued expenses and other liabilities (5,054) (5,045)\nAccrued revenue share (322) 116\nDeferred revenue (141) 500\nNet cash provided by operating activities 28,848 36,150\nInvesting activities\nPurchases of property and equipment (12,012) (17,197)\nPurchases of marketable securities (20,684) (18,453)\nMaturities and sales of marketable securities 24,985 20,345\nPurchases of non-marketable securities (1,206) (958)\nMaturities and sales of non-marketable securities 313 259\nAcquisitions, net of cash acquired, and purchases of intangible assets (61) (340)\nOther investing activities 101 150\nNet cash used in investing activities (8,564) (16,194)\nFinancing activities\nNet payments related to stock-based award activities (2,929) (3,110)\nRepurchases of stock (15,696) (15,068)\nDividend payments 0 (2,434)\nProceeds from issuance of debt, net of costs 1,982 4,532\nRepayments of debt (3,079) (4,521)\nProceeds from sale of interest in consolidated entities, net 8 400\nNet cash used in financing activities (19,714) (20,201)\nEffect of exchange rate changes on cash and cash equivalents (125) 43\nNet increase (decrease) in cash and cash equivalents 445 (202)\nCash and cash equivalents at beginning of period 24,048 23,466\nCash and cash equivalents at end of period $ 24,493 $ 23,264\nSee accompanying notes.\n9",
      "mdna_text": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other\nproducts and services, such as fees received for subscription-based products, apps and in-app purchases, and\ndevices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated\nFinancial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product, service, and market launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources\n(\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to\nbe, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n32\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google\nsearch properties and other Google owned and operated properties including Gmail, Google Maps, and Google\nPlay. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the\naverage amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in\nAdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based\nrevenues divided by our total number of impressions, and represents the average amount we charge advertisers for\neach impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring,\ngathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues\ngenerated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google\nSearch & other properties and the change in impressions and cost-per-impression on Google Network properties\nand the correlation between these items have been, and may continue to be, affected by factors in addition to the\ngeneral factors described above, such as:\n• advertiser competition for keywords;\n• changes in advertising quality, formats, delivery or policy;\n• changes in device mix;\n• seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as\ntraditional retail seasonality; and\n• traffic growth in emerging markets compared to more mature markets and across various verticals and\nchannels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n• consumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV,\nYouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n• platforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n• devices, which primarily include sales of the Pixel family of devices; and\n• other products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be,\naffected by factors in addition to the general factors described above, such as changes in customer usage and\ndemand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n• Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure,\nplatform, and other services. These services provide access to solutions such as AI offerings including our\nAI infrastructure, Vertex AI platform, and Gemini for Google Cloud: cybersecurity; and data and analytics;\n• Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for\nenterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for\nGoogle Workspace; and\n• other enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition\nto the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of healthcare-related services and internet\nservices.\n33\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses\ninclude costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs\nand expenses, including those associated with the operation of our technical infrastructure as well as components\nof our operating expenses, are generally less variable in nature and may not correlate to changes in revenue.\nAdditionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount\ndue to factors such as annual SBC awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n• TAC includes:\n◦ amounts paid to our distribution partners who make available our search access points and\nservices. Our distribution partners include browser providers, mobile carriers, original equipment\nmanufacturers, and software developers; and\n◦ amounts paid to Google Network partners primarily for ads displayed on their properties.\n• Other cost of revenues primarily includes:\n◦ content acquisition costs, which are payments to content providers from whom we license video\nand other content for distribution, primarily related to YouTube (we pay fees to these content\nproviders based on revenues generated, subscriber counts, or a flat fee);\n◦ depreciation expense related to our technical infrastructure;\n◦ employee compensation expenses related to our technical infrastructure and other operations such\nas content review and customer and product support;\n◦ inventory and other costs related to the devices we sell; and\n◦ other technical infrastructure operations costs, including network capacity, energy, and equipment\ncosts.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly\nhigher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties,\nbecause most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our\nGoogle Network partners.\nOperating Expenses\nOperating expenses are generally incurred during our normal course of business, which we categorize as\neither R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n• depreciation;\n• employee compensation expenses for engineering and technical employees responsible for R&D related to\nour existing and new products and services; and\n• third-party services fees primarily relating to consulting and outsourced services in support of our\nengineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n• employee compensation expenses for employees engaged in sales and marketing, sales support, and\ncertain customer service functions; and\n• spend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n• employee compensation expenses for employees in finance, human resources, information technology,\nlegal, and other administrative support functions;\n• expenses relating to legal and other matters, including certain fines and settlements; and\n34\n• third-party services fees, including audit, consulting, outside legal, and other outsourced administrative\nservices.\nOther Income (Expense), Net\nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains\n(losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees,\nand income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations\nin the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II,\nItem 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-\nK for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements\nincluded in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes\nincurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve\nprovisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II,\nItem 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the\nNotes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nExecutive Overview\nThe following table summarizes consolidated financial results (in millions, except per share information and\npercentages):\nThree Months Ended\nMarch 31,\n2024 2025 $ Change % Change\nConsolidated revenues $ 80,539 $ 90,234 $ 9,695 12 %\nChange in consolidated constant currency revenues(1) 14 %\nCost of revenues $ 33,712 $ 36,361 $ 2,649 8 %\nOperating expenses $ 21,355 $ 23,267 $ 1,912 9 %\nOperating income $ 25,472 $ 30,606 $ 5,134 20 %\nOperating margin 32 % 34 % 2 %\nOther income (expense), net $ 2,843 $ 11,183 $ 8,340 293 %\nNet income $ 23,662 $ 34,540 $ 10,878 46 %\nDiluted EPS (2) $ 1.89 $ 2.81 $ 0.92 49 %\n(1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency\ninformation.\n(2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements\nincluded in Item 1 of this Quarterly Report on Form 10-Q.\n• Revenues were $90.2 billion, an increase of 12% year over year, primarily driven by an increase in Google\nServices revenues of $6.9 billion, or 10%, and an increase in Google Cloud revenues of $2.7 billion, or\n28%.\n• Total constant currency revenues, which exclude the effect of hedging, increased 14% year over year.\n• Cost of revenues was $36.4 billion, an increase of 8% year over year, primarily driven by increases in\ncontent acquisition costs, TAC, and depreciation expense.\n35\n• Operating expenses were $23.3 billion, an increase of 9% year over year, primarily driven by increases in\ndepreciation expense, employee compensation expenses, and other technical infrastructure operations\ncosts.\nOther Information:\n• In March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for\n$32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to\nclose in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. Upon\nthe close of the acquisition, Wiz will be part of the Google Cloud segment.\n• In April 2025, the Board of Directors of Alphabet declared a quarterly cash dividend of $0.21 representing a\n5% increase from the previous quarterly dividend of $0.20. The dividend is payable on June 16, 2025 to\nstockholders of record for each of the company’s Class A, Class B, and Class C shares as of June 9, 2025.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item\n1 of this Quarterly Report on Form 10-Q\n• Repurchases of Class A and Class C shares were $2.8 billion and $12.5 billion, respectively, totaling $15.3\nbillion for the three months ended March 31, 2025. For additional information, see Note 11 of the Notes to\nConsolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\n• OI&E of $11.2 billion for the three months ended March 31, 2025 included an $8.0 billion unrealized gain on\nour non-marketable equity securities related to our investment in a private company.\n• Operating cash flow was $36.2 billion for the three months ended March 31, 2025.\n• Capital expenditures, which primarily reflected investments in technical infrastructure, were $17.2 billion for\nthe three months ended March 31, 2025.\n• As of March 31, 2025, we had 185,719 employees.\nWe are monitoring ongoing developments surrounding international trade and the macroeconomic\nenvironment. As a result of volatility in international trade and financial markets, we may experience direct and\nindirect effects on our business, operations, and financial results. Our past results may not be indicative of our\nfuture performance, and our financial results may differ materially from historical trends.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nGoogle Search & other $ 46,156 $ 50,702\nYouTube ads 8,090 8,927\nGoogle Network 7,413 7,256\nGoogle advertising 61,659 66,885\nGoogle subscriptions, platforms, and devices 8,739 10,379\nGoogle Services total 70,398 77,264\nGoogle Cloud 9,574 12,260\nOther Bets 495 450\nHedging gains (losses) 72 260\nTotal revenues $ 80,539 $ 90,234\n36\nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $4.5 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The overall growth was driven by interrelated factors including increases in\nsearch queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending;\nand improvements we have made in ad formats and delivery.\nYouTube ads\nYouTube ads revenues increased $837 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025. The growth was driven by our direct response advertising products followed by our\nbrand advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $157 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025, primarily due to the unfavorable effect of foreign currency exchange rates and a\ndecrease in Google Ad Manager and AdMob revenues. These decreases were partially offset by an increase in\nAdSense revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a\npercentage, from three months ended March 31, 2024 to three months ended March 31, 2025:\nGoogle Search & other\nPaid clicks change 2 %\nCost-per-click change 7 %\nGoogle Network\nImpressions change (5) %\nCost-per-impression change 4 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $1.6 billion from the three months ended\nMarch 31, 2024 to the three months ended March 31, 2025. The growth was primarily driven by an increase in\nsubscription revenues. The increase in subscription revenues was primarily due to growth in the number of paid\nsubscribers across both YouTube services and Google One.\nGoogle Cloud\nGoogle Cloud revenues increased $2.7 billion from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure\nservices.\n37\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the\naddresses of our customers:\nThree Months Ended\nMarch 31,\n2024 2025\nUnited States 48 % 49 %\nEMEA 30 % 29 %\nAPAC 16 % 16 %\nOther Americas 6 % 6 %\nHedging gains (losses) 0 % 0 %\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in\nmultiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period\ncomparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP\npercentage change in constant currency revenues (\"percentage change in constant currency revenues\") for\nfinancial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe\nthe presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to\nunderstand our performance, because it excludes the effects of foreign currency volatility that are not indicative of\nour core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant\nperiod over period. We define constant currency revenues as revenues excluding the effect of foreign currency\nexchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated\nlevel. We use constant currency revenues to determine the constant currency revenue percentage change on a\nyear-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior\nyear comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period\nrevenues over prior year comparable period revenues where current period foreign currency revenues are\ntranslated using prior year comparable period exchange rates and hedging effects are excluded from revenues of\nboth periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with\nGAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled\nmeasures used by other companies and are not a measure of performance presented in accordance with GAAP.\n38\nThe following table presents the foreign currency exchange effect on international revenues and total revenues\n(in millions, except percentages):\nThree Months Ended March 31, 2025\n% Change from Prior Period\nThree Months Ended\nMarch 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2024 2025 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 38,737 $ 43,964 $ 0 $ 43,964 13 % 0 % 13 %\nEMEA 23,788 25,923 (724) 26,647 9 % (3) % 12 %\nAPAC 13,289 14,854 (381) 15,235 12 % (3) % 15 %\nOther Americas 4,653 5,233 (500) 5,733 12 % (11) % 23 %\nRevenues, excluding hedging\neffect 80,467 89,974 (1,605) 91,579 12 % (2) % 14 %\nHedging gains (losses) 72 260\nTotal revenues(1) $ 80,539 $ 90,234 $ 91,579 12 % 0 % (2) % 14 %\n(1) Total constant currency revenues of $91.6 billion for the three months ended March 31, 2025 increased $11.1 billion\ncompared to $80.5 billion in revenues, excluding hedging effect, for the three months ended March 31, 2024.\nEMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen, Australian dollar, and South Korean won.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Brazilian real.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nTAC $ 12,946 $ 13,748\nOther cost of revenues 20,766 22,613\nTotal cost of revenues $ 33,712 $ 36,361\nTotal cost of revenues as a percentage of revenues 42 % 40 %\nCost of revenues increased $2.6 billion from the three months ended March 31, 2024 to the three months\nended March 31, 2025 due to an increase in other cost of revenues and TAC of $1.8 billion and $802 million,\nrespectively.\nThe increase in TAC from the three months ended March 31, 2024 to the three months ended March 31, 2025\nwas largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to\nTAC. The TAC rate decreased from 21.0% to 20.6% from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to a revenue mix shift from Google Network properties to Google\nSearch & other properties. The TAC rate on Google Search & other revenues increased from the three months\nended March 31, 2024 to the three months ended March 31, 2025 primarily due to increases related to mobile\nsearches, which carries higher TAC because more mobile searches are channeled through paid access points. The\nTAC rate on Google Network revenues decreased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to a combination of factors, none of which were individually significant.\nThe increase in other cost of revenues from the three months ended March 31, 2024 to the three months\nended March 31, 2025 was primarily due to increases in content acquisition costs, largely for YouTube,\ndepreciation expense, and other technical infrastructure operations costs.\n39\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nResearch and development expenses $ 11,903 $ 13,556\nResearch and development expenses as a percentage of revenues 15 % 15 %\nR&D expenses increased $1.7 billion from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025, primarily driven by increases in employee compensation expenses of $697 million and depreciation\nexpense of $491 million.\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nSales and marketing expenses $ 6,426 $ 6,172\nSales and marketing expenses as a percentage of revenues 8 % 7 %\nSales and marketing expenses decreased $254 million from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025 primarily driven by a decrease in employee compensation expenses of $307\nmillion.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nGeneral and administrative expenses $ 3,026 $ 3,539\nGeneral and administrative expenses as a percentage of revenues 4 % 4 %\nGeneral and administrative expenses increased $513 million from the three months ended March 31, 2024 to\nthe three months ended March 31, 2025, primarily driven by an increase in charges related to legal and other\nmatters of $292 million and a combination of other factors, none of which were individually significant.\nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs\nare not allocated to our segments because they represent Alphabet-level activities. For further details on our\nsegments, Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on\nForm 10-Q.\n40\nThe following table presents segment operating income (loss) (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nOperating income (loss):\nGoogle Services $ 27,897 $ 32,682\nGoogle Cloud 900 2,177\nOther Bets (1,020) (1,226)\nAlphabet-level activities(1) (2,305) (3,027)\nTotal income from operations $ 25,472 $ 30,606\n(1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $72 million and\n$260 million for the three months ended March 31, 2024 and 2025, respectively. Alphabet-level activities include all of the\ncharges related to employee severance and office space charges.\nGoogle Services\nGoogle Services operating income increased $4.8 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The increase in operating income was primarily driven by an increase in\nrevenues, partially offset by increases in content acquisition costs and TAC.\nGoogle Cloud\nGoogle Cloud operating income increased $1.3 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The increase in operating income was primarily driven by an increase in\nrevenues, partially offset by increases in usage costs for technical infrastructure and employee compensation\nexpenses.\nOther Bets\nOther Bets operating loss increased $206 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025. The increase in operating loss was due to a combination of factors, none of which\nwere individually significant.\nOther Income (Expense), Net\nThe following table presents OI&E (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nInterest income $ 1,061 $ 1,001\nInterest expense (94) (34)\nForeign currency exchange gain (loss), net (238) (106)\nGain (loss) on debt securities, net (462) 202\nGain (loss) on equity securities, net 2,243 9,758\nPerformance fees 104 (40)\nIncome (loss) and impairment from equity method investments, net (26) (22)\nOther 255 424\nOther income (expense), net $ 2,843 $ 11,183\nOI&E, net increased $8.3 billion from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025 primarily due to an increase in net gains on equity securities. The net gains on equity securities\nwere due to net unrealized gains on non-marketable equity securities driven by fair value adjustments related to\nobservable transactions.\nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included\nin Item 1 of this Quarterly Report on Form 10-Q.\n41\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\nThree Months Ended\nMarch 31,\n2024 2025\nIncome before provision for income taxes $ 28,315 $ 41,789\nProvision for income taxes $ 4,653 $ 7,249\nEffective tax rate 16.4 % 17.3 %\nThe effective tax rate increased from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025. This increase was primarily due to lower effective tax rate impacts in the U.S. federal Foreign\nDerived Intangible Income tax deduction, R&D credits, and stock-based compensation-related tax benefits.\nThe OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus\naround substantial changes to international tax policies, including the implementation of a minimum global effective\ntax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect\nothers to follow, however this did not have a material effect on our income tax provision for the period ending\nMarch 31, 2025.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of March 31, 2025, we had $95.3 billion in cash, cash equivalents, and short-term marketable securities.\nCash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid\ngovernment bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity\nsecurities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash\nflow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth\nof the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital\nreturn to stockholders.\nThe following table presents cash flows (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nNet cash provided by operating activities $ 28,848 $ 36,150\nNet cash used in investing activities $ (8,564) $ (16,194)\nNet cash used in financing activities $ (19,714) $ (20,201)\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search &\nother properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash\nthrough consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we\ngenerate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and\nother cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network\npartners, to employees for compensation, and to content providers. Other uses of cash from operating activities\ninclude payments to suppliers for devices, to tax authorities for income taxes, and other general corporate\nexpenditures.\nNet cash provided by operating activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to an increase in cash received from customers, partially offset by an increase in\ncash payments for cost of revenues and operating expenses.\n42\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable\nand non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and\nnon-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to an increase in purchases of property and equipment and a decrease\nin maturities and sales of marketable securities, partially offset by a decrease in purchases of marketable securities.\nThe increase in purchases of property and equipment is primarily driven by investments in technical infrastructure.\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from\nthe sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of\nstock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to dividend payments, partially offset by an increase in proceeds from issuance\nof debt, net of repayments.\nLiquidity and Material Cash Requirements\nWe expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations\nand financing activities to continue to be sufficient to fund our operating activities and cash commitments for\ninvesting and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property\nand equipment and lease arrangements to provide capacity for the growth of our services and products.\nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n• technical infrastructure, which consists of our investments in servers and network equipment for computing,\nstorage, and networking requirements for ongoing business activities, including AI, and data center land and\nbuilding construction; and\n• office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of\nconstruction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to\nplacement in service of these assets may extend from months to years. For example, our data center construction\nprojects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct\nbuildings, and secure and install servers and network equipment.\nDuring the three months ended March 31, 2024 and 2025, we spent $12.0 billion and $17.2 billion on capital\nexpenditures, respectively. We expect to increase, relative to 2024, our investment in our technical infrastructure,\nincluding servers, network equipment, and data centers, to support the growth of our business and our long-term\ninitiatives, in particular in support of AI products and services. Depreciation of our property and equipment\ncommences when such assets are ready for our intended use. For the three months ended March 31, 2024 and\n2025, depreciation on property and equipment was $3.4 billion and $4.5 billion, respectively.\nLeases\nAs of March 31, 2025, the amount of total future lease payments under operating and finance leases was\n$17.0 billion and $2.5 billion, respectively.\nAs of March 31, 2025, we have entered into leases primarily related to data centers that have not yet\ncommenced with future lease payments of $17.3 billion. These leases will commence between 2025 and 2031 with\nnon-cancelable lease terms between one and 25 years.\n43\nFor additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in\nItem 1 of this Quarterly Report on Form 10-Q.\nFinancing\nWe have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper.\nNet proceeds from this program are used for general corporate purposes. As of March 31, 2025, we had $2.5 billion\nof short-term commercial paper outstanding.\nAs of March 31, 2025, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion.\nAs of March 31, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2025 and\n$6.0 billion expiring in April 2028. In April 2025, we entered into a new $4.0 billion revolving credit facility expiring in\nApril 2026. Additionally, we terminated the $6.0 billion revolving credit facility expiring in April 2028 and entered into\na new $6.0 billion revolving credit facility expiring in April 2030. The interest rates for all credit facilities are\ndetermined based on a formula using certain market rates. No amounts have been borrowed under the credit\nfacilities.\nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure\nand devices we sell. We have agreements where we may purchase components directly from suppliers and then\nsupply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of\nthese arrangements result in a portion of the cash received from and paid to the contract manufacturers to be\npresented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly\nReport on Form 10-Q.\nShare Repurchase Program\nDuring the three months ended March 31, 2025, we repurchased and subsequently retired 83 million shares\nfor $15.3 billion.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its\nClass A and Class C shares. As of March 31, 2025, $29.5 billion remained available for Class A and Class C share\nrepurchases. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an\nadditional $70.0 billion of Class A and Class C shares.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nThree Months Ended March 31, 2025\nShares Amount\nClass A share repurchases 15 $ 2,766\nClass C share repurchases 68 12,535\nTotal share repurchases(1) 83 $ 15,301\n(1) Shares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nDividend Program\nIn the three months ended March 31, 2025, total cash dividends were $1.2 billion, $171 million, and $1.1 billion\nfor Class A, Class B, and Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet declared a quarterly cash dividend of $0.21 representing a 5%\nincrease from the previous quarterly dividend of $0.20. The dividend is payable on June 16, 2025 to stockholders of\nrecord for each of the company’s Class A, Class B, and Class C shares as of June 9, 2025.\nThe company intends to pay quarterly cash dividends in the future, subject to review and approval by the\ncompany’s Board of Directors in its sole discretion.\n44\nEuropean Commission Fines\nIn 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European\ncompetition law and imposed fines of €4.3 billion ($5.1 billion as of June 30, 2018) and €1.5 billion ($1.7 billion as of\nMarch 20, 2019), respectively.\nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from €4.3 billion to\n€4.1 billion. We subsequently appealed the General Court's affirmation of the EC with the European Court of\nJustice, which remains pending.\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the €1.5 billion fine.\nThe EC has appealed the General Court's decision to the European Court of Justice.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current\nliabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated\nFinancial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nTaxes\nAs of March 31, 2025, we had income taxes payable of $2.7 billion related to a one-time transition tax payable\nincurred as a result of the U.S. Tax Cuts and Jobs Act, which is due in 2025. We also had long-term taxes payable\nof $9.8 billion primarily related to uncertain tax positions as of March 31, 2025.\nPurchase Commitments and Other Contractual Obligations\nAs of March 31, 2025, we had material purchase commitments and other contractual obligations of $62.1\nbillion, of which $41.5 billion was short-term. These amounts primarily consist of purchase orders for certain\ntechnical infrastructure as well as the non-cancelable portion or the minimum cancellation fee in certain agreements\nrelated to commitments to purchase licenses, including content licenses, inventory, and network capacity. For those\nagreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities\nand/or pricing as of March 31, 2025. In certain instances, the amount of our contractual obligations may change\nbased on the expected timing of order fulfillment from our suppliers. For more information related to our content\nlicenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report\non Form 10-Q.\nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and\nenergy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar\ncommitment. The amounts to be paid under these agreements are based on the actual volumes to be generated\nand are not readily determinable.\nWe may experience increases in the costs associated with our purchase commitments and other contractual\nobligations as a result of ongoing developments surrounding international trade. For details on risks related to our\nmanufacturing and supply chain and other risks, refer to Part I, Item 1A, \"Risk Factors\" in our Annual Report on\nForm 10-K for the fiscal year ending December 31, 2024.\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for\n$32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in\n2026, subject to customary closing conditions, including the receipt of regulatory approvals. For additional\ninformation, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly\nReport on Form 10-Q.\nCritical Accounting Estimates\nSee Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended\nDecember 31, 2024.\nAvailable Information\nOur website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor.\nAccess to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and\nour Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of\ncharge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov.\nWe webcast via our investor relations YouTube channel and website our earnings calls and certain events we\nparticipate in or host with members of the investment community. Our investor relations website also provides\n45",
      "title_page_text": "UNITED STATES\nSECURITIES AND EXCHANGE COMMISSION\nWashington, D.C. 20549\n________________________________________________________________________________________\nFORM 10-Q\n________________________________________________________________________________________\n(Mark One)\n☒ QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the quarterly period ended March 31, 2025\nOR\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the transition period from _______ to _______\nCommission file number: 001-37580\n________________________________________________________________________________________\nAlphabet Inc.\n(Exact name of registrant as specified in its charter)\n________________________________________________________________________________________\nDelaware 61-1767919\n(State or other jurisdiction of incorporation or organization) (I.R.S. Employer Identification Number)\n1600 Amphitheatre Parkway\nMountain View, CA 94043\n(Address of principal executive offices, including zip code)\n(650) 253-0000\n(Registrant's telephone number, including area code)\nSecurities registered pursuant to Section 12(b) of the Act:\nTitle of each class Trading Symbol(s) Name of each exchange on which registered\nClass A Common Stock, $0.001 par value GOOGL Nasdaq Stock Market LLC\n(Nasdaq Global Select Market)\nClass C Capital Stock, $0.001 par value GOOG Nasdaq Stock Market LLC\n(Nasdaq Global Select Market)\n________________________________________________________________________________________\nIndicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities\nExchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such\nreports), and (2) has been subject to such filing requirements for the past 90 days. Yes ☒ No ☐\nIndicate by check mark whether the registrant has submitted electronically every Interactive Data File required to be submitted\npursuant to Rule 405 of Regulation S-T (§232.405 of this chapter) during the preceding 12 months (or for such shorter period\nthat the registrant was required to submit such files). Yes ☒ No ☐\nIndicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, a smaller\nreporting company, or an emerging growth company. See the definitions of “large accelerated filer,” “accelerated filer,” “smaller\nreporting company,” and \"emerging growth company\" in Rule 12b-2 of the Exchange Act.\nLarge accelerated filer ☒ Accelerated filer ☐\nNon-accelerated filer ☐ Smaller reporting company ☐\nEmerging growth company ☐\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for\ncomplying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐\nIndicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes ☐ No\n☒\nAs of April 17, 2025, there were 5,820 million shares of Alphabet’s Class A stock outstanding, 856 million shares of Alphabet's\nClass B stock outstanding, and 5,459 million shares of Alphabet's Class C stock outstanding."
    }
  },
  {
    "analyze_sections": {
      "pdf_path": "C:/Users/Yi/OneDrive/Desktop/UChicago25Spring/FinAgent/goog-10-q-q1-2025.pdf",
      "income_text": "Table of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share amounts; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nRevenues $ 80,539 $ 90,234\nCosts and expenses:\nCost of revenues 33,712 36,361\nResearch and development 11,903 13,556\nSales and marketing 6,426 6,172\nGeneral and administrative 3,026 3,539\nTotal costs and expenses 55,067 59,628\nIncome from operations 25,472 30,606\nOther income (expense), net 2,843 11,183\nIncome before income taxes 28,315 41,789\nProvision for income taxes 4,653 7,249\nNet income $ 23,662 $ 34,540\nBasic net income per share (Note 12) $ 1.91 $ 2.84\nDiluted net income per share (Note 12) $ 1.89 $ 2.81\nSee accompanying notes.\n6\nTable of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nNet income $ 23,662 $ 34,540\nOther comprehensive income (loss):\nChange in foreign currency translation adjustment, net of income tax benefit\n(expense) of $(18) and $45 (503) 663\nAvailable-for-sale investments:\nChange in net unrealized gains (losses) (360) 645\nLess: reclassification adjustment for net (gains) losses included in net\nincome 311 (84)\nNet change, net of income tax benefit (expense) of $14 and $(159) (49) 561\nCash flow hedges:\nChange in net unrealized gains (losses) 186 (313)\nLess: reclassification adjustment for net (gains) losses included in net\nincome (71) (197)\nNet change, net of income tax benefit (expense) of $(23) and $131 115 (510)\nOther comprehensive income (loss) (437) 714\nComprehensive income $ 23,225 $ 35,254\nSee accompanying notes.\n7",
      "cashflow_text": "Table of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nOperating activities\nNet income $ 23,662 $ 34,540\nAdjustments:\nDepreciation of property and equipment 3,413 4,487\nStock-based compensation expense 5,264 5,516\nDeferred income taxes 419 (1,152)\nLoss (gain) on debt and equity securities, net (1,781) (9,960)\nOther 334 481\nChanges in assets and liabilities, net of effects of acquisitions:\nAccounts receivable, net 3,167 1,638\nIncome taxes, net 3,011 7,197\nOther assets (1,000) (1,288)\nAccounts payable (2,124) (880)\nAccrued expenses and other liabilities (5,054) (5,045)\nAccrued revenue share (322) 116\nDeferred revenue (141) 500\nNet cash provided by operating activities 28,848 36,150\nInvesting activities\nPurchases of property and equipment (12,012) (17,197)\nPurchases of marketable securities (20,684) (18,453)\nMaturities and sales of marketable securities 24,985 20,345\nPurchases of non-marketable securities (1,206) (958)\nMaturities and sales of non-marketable securities 313 259\nAcquisitions, net of cash acquired, and purchases of intangible assets (61) (340)\nOther investing activities 101 150\nNet cash used in investing activities (8,564) (16,194)\nFinancing activities\nNet payments related to stock-based award activities (2,929) (3,110)\nRepurchases of stock (15,696) (15,068)\nDividend payments 0 (2,434)\nProceeds from issuance of debt, net of costs 1,982 4,532\nRepayments of debt (3,079) (4,521)\nProceeds from sale of interest in consolidated entities, net 8 400\nNet cash used in financing activities (19,714) (20,201)\nEffect of exchange rate changes on cash and cash equivalents (125) 43\nNet increase (decrease) in cash and cash equivalents 445 (202)\nCash and cash equivalents at beginning of period 24,048 23,466\nCash and cash equivalents at end of period $ 24,493 $ 23,264\nSee accompanying notes.\n9",
      "mdna_text": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other\nproducts and services, such as fees received for subscription-based products, apps and in-app purchases, and\ndevices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated\nFinancial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product, service, and market launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources\n(\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to\nbe, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n32\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google\nsearch properties and other Google owned and operated properties including Gmail, Google Maps, and Google\nPlay. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the\naverage amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in\nAdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based\nrevenues divided by our total number of impressions, and represents the average amount we charge advertisers for\neach impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring,\ngathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues\ngenerated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google\nSearch & other properties and the change in impressions and cost-per-impression on Google Network properties\nand the correlation between these items have been, and may continue to be, affected by factors in addition to the\ngeneral factors described above, such as:\n• advertiser competition for keywords;\n• changes in advertising quality, formats, delivery or policy;\n• changes in device mix;\n• seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as\ntraditional retail seasonality; and\n• traffic growth in emerging markets compared to more mature markets and across various verticals and\nchannels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n• consumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV,\nYouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n• platforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n• devices, which primarily include sales of the Pixel family of devices; and\n• other products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be,\naffected by factors in addition to the general factors described above, such as changes in customer usage and\ndemand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n• Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure,\nplatform, and other services. These services provide access to solutions such as AI offerings including our\nAI infrastructure, Vertex AI platform, and Gemini for Google Cloud: cybersecurity; and data and analytics;\n• Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for\nenterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for\nGoogle Workspace; and\n• other enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition\nto the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of healthcare-related services and internet\nservices.\n33\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses\ninclude costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs\nand expenses, including those associated with the operation of our technical infrastructure as well as components\nof our operating expenses, are generally less variable in nature and may not correlate to changes in revenue.\nAdditionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount\ndue to factors such as annual SBC awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n• TAC includes:\n◦ amounts paid to our distribution partners who make available our search access points and\nservices. Our distribution partners include browser providers, mobile carriers, original equipment\nmanufacturers, and software developers; and\n◦ amounts paid to Google Network partners primarily for ads displayed on their properties.\n• Other cost of revenues primarily includes:\n◦ content acquisition costs, which are payments to content providers from whom we license video\nand other content for distribution, primarily related to YouTube (we pay fees to these content\nproviders based on revenues generated, subscriber counts, or a flat fee);\n◦ depreciation expense related to our technical infrastructure;\n◦ employee compensation expenses related to our technical infrastructure and other operations such\nas content review and customer and product support;\n◦ inventory and other costs related to the devices we sell; and\n◦ other technical infrastructure operations costs, including network capacity, energy, and equipment\ncosts.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly\nhigher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties,\nbecause most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our\nGoogle Network partners.\nOperating Expenses\nOperating expenses are generally incurred during our normal course of business, which we categorize as\neither R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n• depreciation;\n• employee compensation expenses for engineering and technical employees responsible for R&D related to\nour existing and new products and services; and\n• third-party services fees primarily relating to consulting and outsourced services in support of our\nengineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n• employee compensation expenses for employees engaged in sales and marketing, sales support, and\ncertain customer service functions; and\n• spend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n• employee compensation expenses for employees in finance, human resources, information technology,\nlegal, and other administrative support functions;\n• expenses relating to legal and other matters, including certain fines and settlements; and\n34\n• third-party services fees, including audit, consulting, outside legal, and other outsourced administrative\nservices.\nOther Income (Expense), Net\nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains\n(losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees,\nand income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations\nin the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II,\nItem 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-\nK for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements\nincluded in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes\nincurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve\nprovisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II,\nItem 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the\nNotes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nExecutive Overview\nThe following table summarizes consolidated financial results (in millions, except per share information and\npercentages):\nThree Months Ended\nMarch 31,\n2024 2025 $ Change % Change\nConsolidated revenues $ 80,539 $ 90,234 $ 9,695 12 %\nChange in consolidated constant currency revenues(1) 14 %\nCost of revenues $ 33,712 $ 36,361 $ 2,649 8 %\nOperating expenses $ 21,355 $ 23,267 $ 1,912 9 %\nOperating income $ 25,472 $ 30,606 $ 5,134 20 %\nOperating margin 32 % 34 % 2 %\nOther income (expense), net $ 2,843 $ 11,183 $ 8,340 293 %\nNet income $ 23,662 $ 34,540 $ 10,878 46 %\nDiluted EPS (2) $ 1.89 $ 2.81 $ 0.92 49 %\n(1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency\ninformation.\n(2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements\nincluded in Item 1 of this Quarterly Report on Form 10-Q.\n• Revenues were $90.2 billion, an increase of 12% year over year, primarily driven by an increase in Google\nServices revenues of $6.9 billion, or 10%, and an increase in Google Cloud revenues of $2.7 billion, or\n28%.\n• Total constant currency revenues, which exclude the effect of hedging, increased 14% year over year.\n• Cost of revenues was $36.4 billion, an increase of 8% year over year, primarily driven by increases in\ncontent acquisition costs, TAC, and depreciation expense.\n35\n• Operating expenses were $23.3 billion, an increase of 9% year over year, primarily driven by increases in\ndepreciation expense, employee compensation expenses, and other technical infrastructure operations\ncosts.\nOther Information:\n• In March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for\n$32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to\nclose in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. Upon\nthe close of the acquisition, Wiz will be part of the Google Cloud segment.\n• In April 2025, the Board of Directors of Alphabet declared a quarterly cash dividend of $0.21 representing a\n5% increase from the previous quarterly dividend of $0.20. The dividend is payable on June 16, 2025 to\nstockholders of record for each of the company’s Class A, Class B, and Class C shares as of June 9, 2025.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item\n1 of this Quarterly Report on Form 10-Q\n• Repurchases of Class A and Class C shares were $2.8 billion and $12.5 billion, respectively, totaling $15.3\nbillion for the three months ended March 31, 2025. For additional information, see Note 11 of the Notes to\nConsolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\n• OI&E of $11.2 billion for the three months ended March 31, 2025 included an $8.0 billion unrealized gain on\nour non-marketable equity securities related to our investment in a private company.\n• Operating cash flow was $36.2 billion for the three months ended March 31, 2025.\n• Capital expenditures, which primarily reflected investments in technical infrastructure, were $17.2 billion for\nthe three months ended March 31, 2025.\n• As of March 31, 2025, we had 185,719 employees.\nWe are monitoring ongoing developments surrounding international trade and the macroeconomic\nenvironment. As a result of volatility in international trade and financial markets, we may experience direct and\nindirect effects on our business, operations, and financial results. Our past results may not be indicative of our\nfuture performance, and our financial results may differ materially from historical trends.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nGoogle Search & other $ 46,156 $ 50,702\nYouTube ads 8,090 8,927\nGoogle Network 7,413 7,256\nGoogle advertising 61,659 66,885\nGoogle subscriptions, platforms, and devices 8,739 10,379\nGoogle Services total 70,398 77,264\nGoogle Cloud 9,574 12,260\nOther Bets 495 450\nHedging gains (losses) 72 260\nTotal revenues $ 80,539 $ 90,234\n36\nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $4.5 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The overall growth was driven by interrelated factors including increases in\nsearch queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending;\nand improvements we have made in ad formats and delivery.\nYouTube ads\nYouTube ads revenues increased $837 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025. The growth was driven by our direct response advertising products followed by our\nbrand advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $157 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025, primarily due to the unfavorable effect of foreign currency exchange rates and a\ndecrease in Google Ad Manager and AdMob revenues. These decreases were partially offset by an increase in\nAdSense revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a\npercentage, from three months ended March 31, 2024 to three months ended March 31, 2025:\nGoogle Search & other\nPaid clicks change 2 %\nCost-per-click change 7 %\nGoogle Network\nImpressions change (5) %\nCost-per-impression change 4 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $1.6 billion from the three months ended\nMarch 31, 2024 to the three months ended March 31, 2025. The growth was primarily driven by an increase in\nsubscription revenues. The increase in subscription revenues was primarily due to growth in the number of paid\nsubscribers across both YouTube services and Google One.\nGoogle Cloud\nGoogle Cloud revenues increased $2.7 billion from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure\nservices.\n37\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the\naddresses of our customers:\nThree Months Ended\nMarch 31,\n2024 2025\nUnited States 48 % 49 %\nEMEA 30 % 29 %\nAPAC 16 % 16 %\nOther Americas 6 % 6 %\nHedging gains (losses) 0 % 0 %\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in\nmultiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period\ncomparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP\npercentage change in constant currency revenues (\"percentage change in constant currency revenues\") for\nfinancial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe\nthe presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to\nunderstand our performance, because it excludes the effects of foreign currency volatility that are not indicative of\nour core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant\nperiod over period. We define constant currency revenues as revenues excluding the effect of foreign currency\nexchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated\nlevel. We use constant currency revenues to determine the constant currency revenue percentage change on a\nyear-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior\nyear comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period\nrevenues over prior year comparable period revenues where current period foreign currency revenues are\ntranslated using prior year comparable period exchange rates and hedging effects are excluded from revenues of\nboth periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with\nGAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled\nmeasures used by other companies and are not a measure of performance presented in accordance with GAAP.\n38\nThe following table presents the foreign currency exchange effect on international revenues and total revenues\n(in millions, except percentages):\nThree Months Ended March 31, 2025\n% Change from Prior Period\nThree Months Ended\nMarch 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2024 2025 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 38,737 $ 43,964 $ 0 $ 43,964 13 % 0 % 13 %\nEMEA 23,788 25,923 (724) 26,647 9 % (3) % 12 %\nAPAC 13,289 14,854 (381) 15,235 12 % (3) % 15 %\nOther Americas 4,653 5,233 (500) 5,733 12 % (11) % 23 %\nRevenues, excluding hedging\neffect 80,467 89,974 (1,605) 91,579 12 % (2) % 14 %\nHedging gains (losses) 72 260\nTotal revenues(1) $ 80,539 $ 90,234 $ 91,579 12 % 0 % (2) % 14 %\n(1) Total constant currency revenues of $91.6 billion for the three months ended March 31, 2025 increased $11.1 billion\ncompared to $80.5 billion in revenues, excluding hedging effect, for the three months ended March 31, 2024.\nEMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen, Australian dollar, and South Korean won.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Brazilian real.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nTAC $ 12,946 $ 13,748\nOther cost of revenues 20,766 22,613\nTotal cost of revenues $ 33,712 $ 36,361\nTotal cost of revenues as a percentage of revenues 42 % 40 %\nCost of revenues increased $2.6 billion from the three months ended March 31, 2024 to the three months\nended March 31, 2025 due to an increase in other cost of revenues and TAC of $1.8 billion and $802 million,\nrespectively.\nThe increase in TAC from the three months ended March 31, 2024 to the three months ended March 31, 2025\nwas largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to\nTAC. The TAC rate decreased from 21.0% to 20.6% from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to a revenue mix shift from Google Network properties to Google\nSearch & other properties. The TAC rate on Google Search & other revenues increased from the three months\nended March 31, 2024 to the three months ended March 31, 2025 primarily due to increases related to mobile\nsearches, which carries higher TAC because more mobile searches are channeled through paid access points. The\nTAC rate on Google Network revenues decreased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to a combination of factors, none of which were individually significant.\nThe increase in other cost of revenues from the three months ended March 31, 2024 to the three months\nended March 31, 2025 was primarily due to increases in content acquisition costs, largely for YouTube,\ndepreciation expense, and other technical infrastructure operations costs.\n39\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nResearch and development expenses $ 11,903 $ 13,556\nResearch and development expenses as a percentage of revenues 15 % 15 %\nR&D expenses increased $1.7 billion from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025, primarily driven by increases in employee compensation expenses of $697 million and depreciation\nexpense of $491 million.\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nSales and marketing expenses $ 6,426 $ 6,172\nSales and marketing expenses as a percentage of revenues 8 % 7 %\nSales and marketing expenses decreased $254 million from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025 primarily driven by a decrease in employee compensation expenses of $307\nmillion.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nGeneral and administrative expenses $ 3,026 $ 3,539\nGeneral and administrative expenses as a percentage of revenues 4 % 4 %\nGeneral and administrative expenses increased $513 million from the three months ended March 31, 2024 to\nthe three months ended March 31, 2025, primarily driven by an increase in charges related to legal and other\nmatters of $292 million and a combination of other factors, none of which were individually significant.\nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs\nare not allocated to our segments because they represent Alphabet-level activities. For further details on our\nsegments, Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on\nForm 10-Q.\n40\nThe following table presents segment operating income (loss) (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nOperating income (loss):\nGoogle Services $ 27,897 $ 32,682\nGoogle Cloud 900 2,177\nOther Bets (1,020) (1,226)\nAlphabet-level activities(1) (2,305) (3,027)\nTotal income from operations $ 25,472 $ 30,606\n(1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $72 million and\n$260 million for the three months ended March 31, 2024 and 2025, respectively. Alphabet-level activities include all of the\ncharges related to employee severance and office space charges.\nGoogle Services\nGoogle Services operating income increased $4.8 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The increase in operating income was primarily driven by an increase in\nrevenues, partially offset by increases in content acquisition costs and TAC.\nGoogle Cloud\nGoogle Cloud operating income increased $1.3 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The increase in operating income was primarily driven by an increase in\nrevenues, partially offset by increases in usage costs for technical infrastructure and employee compensation\nexpenses.\nOther Bets\nOther Bets operating loss increased $206 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025. The increase in operating loss was due to a combination of factors, none of which\nwere individually significant.\nOther Income (Expense), Net\nThe following table presents OI&E (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nInterest income $ 1,061 $ 1,001\nInterest expense (94) (34)\nForeign currency exchange gain (loss), net (238) (106)\nGain (loss) on debt securities, net (462) 202\nGain (loss) on equity securities, net 2,243 9,758\nPerformance fees 104 (40)\nIncome (loss) and impairment from equity method investments, net (26) (22)\nOther 255 424\nOther income (expense), net $ 2,843 $ 11,183\nOI&E, net increased $8.3 billion from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025 primarily due to an increase in net gains on equity securities. The net gains on equity securities\nwere due to net unrealized gains on non-marketable equity securities driven by fair value adjustments related to\nobservable transactions.\nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included\nin Item 1 of this Quarterly Report on Form 10-Q.\n41\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\nThree Months Ended\nMarch 31,\n2024 2025\nIncome before provision for income taxes $ 28,315 $ 41,789\nProvision for income taxes $ 4,653 $ 7,249\nEffective tax rate 16.4 % 17.3 %\nThe effective tax rate increased from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025. This increase was primarily due to lower effective tax rate impacts in the U.S. federal Foreign\nDerived Intangible Income tax deduction, R&D credits, and stock-based compensation-related tax benefits.\nThe OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus\naround substantial changes to international tax policies, including the implementation of a minimum global effective\ntax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect\nothers to follow, however this did not have a material effect on our income tax provision for the period ending\nMarch 31, 2025.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of March 31, 2025, we had $95.3 billion in cash, cash equivalents, and short-term marketable securities.\nCash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid\ngovernment bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity\nsecurities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash\nflow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth\nof the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital\nreturn to stockholders.\nThe following table presents cash flows (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nNet cash provided by operating activities $ 28,848 $ 36,150\nNet cash used in investing activities $ (8,564) $ (16,194)\nNet cash used in financing activities $ (19,714) $ (20,201)\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search &\nother properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash\nthrough consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we\ngenerate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and\nother cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network\npartners, to employees for compensation, and to content providers. Other uses of cash from operating activities\ninclude payments to suppliers for devices, to tax authorities for income taxes, and other general corporate\nexpenditures.\nNet cash provided by operating activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to an increase in cash received from customers, partially offset by an increase in\ncash payments for cost of revenues and operating expenses.\n42\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable\nand non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and\nnon-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to an increase in purchases of property and equipment and a decrease\nin maturities and sales of marketable securities, partially offset by a decrease in purchases of marketable securities.\nThe increase in purchases of property and equipment is primarily driven by investments in technical infrastructure.\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from\nthe sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of\nstock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to dividend payments, partially offset by an increase in proceeds from issuance\nof debt, net of repayments.\nLiquidity and Material Cash Requirements\nWe expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations\nand financing activities to continue to be sufficient to fund our operating activities and cash commitments for\ninvesting and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property\nand equipment and lease arrangements to provide capacity for the growth of our services and products.\nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n• technical infrastructure, which consists of our investments in servers and network equipment for computing,\nstorage, and networking requirements for ongoing business activities, including AI, and data center land and\nbuilding construction; and\n• office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of\nconstruction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to\nplacement in service of these assets may extend from months to years. For example, our data center construction\nprojects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct\nbuildings, and secure and install servers and network equipment.\nDuring the three months ended March 31, 2024 and 2025, we spent $12.0 billion and $17.2 billion on capital\nexpenditures, respectively. We expect to increase, relative to 2024, our investment in our technical infrastructure,\nincluding servers, network equipment, and data centers, to support the growth of our business and our long-term\ninitiatives, in particular in support of AI products and services. Depreciation of our property and equipment\ncommences when such assets are ready for our intended use. For the three months ended March 31, 2024 and\n2025, depreciation on property and equipment was $3.4 billion and $4.5 billion, respectively.\nLeases\nAs of March 31, 2025, the amount of total future lease payments under operating and finance leases was\n$17.0 billion and $2.5 billion, respectively.\nAs of March 31, 2025, we have entered into leases primarily related to data centers that have not yet\ncommenced with future lease payments of $17.3 billion. These leases will commence between 2025 and 2031 with\nnon-cancelable lease terms between one and 25 years.\n43\nFor additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in\nItem 1 of this Quarterly Report on Form 10-Q.\nFinancing\nWe have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper.\nNet proceeds from this program are used for general corporate purposes. As of March 31, 2025, we had $2.5 billion\nof short-term commercial paper outstanding.\nAs of March 31, 2025, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion.\nAs of March 31, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2025 and\n$6.0 billion expiring in April 2028. In April 2025, we entered into a new $4.0 billion revolving credit facility expiring in\nApril 2026. Additionally, we terminated the $6.0 billion revolving credit facility expiring in April 2028 and entered into\na new $6.0 billion revolving credit facility expiring in April 2030. The interest rates for all credit facilities are\ndetermined based on a formula using certain market rates. No amounts have been borrowed under the credit\nfacilities.\nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure\nand devices we sell. We have agreements where we may purchase components directly from suppliers and then\nsupply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of\nthese arrangements result in a portion of the cash received from and paid to the contract manufacturers to be\npresented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly\nReport on Form 10-Q.\nShare Repurchase Program\nDuring the three months ended March 31, 2025, we repurchased and subsequently retired 83 million shares\nfor $15.3 billion.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its\nClass A and Class C shares. As of March 31, 2025, $29.5 billion remained available for Class A and Class C share\nrepurchases. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an\nadditional $70.0 billion of Class A and Class C shares.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nThree Months Ended March 31, 2025\nShares Amount\nClass A share repurchases 15 $ 2,766\nClass C share repurchases 68 12,535\nTotal share repurchases(1) 83 $ 15,301\n(1) Shares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nDividend Program\nIn the three months ended March 31, 2025, total cash dividends were $1.2 billion, $171 million, and $1.1 billion\nfor Class A, Class B, and Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet declared a quarterly cash dividend of $0.21 representing a 5%\nincrease from the previous quarterly dividend of $0.20. The dividend is payable on June 16, 2025 to stockholders of\nrecord for each of the company’s Class A, Class B, and Class C shares as of June 9, 2025.\nThe company intends to pay quarterly cash dividends in the future, subject to review and approval by the\ncompany’s Board of Directors in its sole discretion.\n44\nEuropean Commission Fines\nIn 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European\ncompetition law and imposed fines of €4.3 billion ($5.1 billion as of June 30, 2018) and €1.5 billion ($1.7 billion as of\nMarch 20, 2019), respectively.\nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from €4.3 billion to\n€4.1 billion. We subsequently appealed the General Court's affirmation of the EC with the European Court of\nJustice, which remains pending.\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the €1.5 billion fine.\nThe EC has appealed the General Court's decision to the European Court of Justice.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current\nliabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated\nFinancial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nTaxes\nAs of March 31, 2025, we had income taxes payable of $2.7 billion related to a one-time transition tax payable\nincurred as a result of the U.S. Tax Cuts and Jobs Act, which is due in 2025. We also had long-term taxes payable\nof $9.8 billion primarily related to uncertain tax positions as of March 31, 2025.\nPurchase Commitments and Other Contractual Obligations\nAs of March 31, 2025, we had material purchase commitments and other contractual obligations of $62.1\nbillion, of which $41.5 billion was short-term. These amounts primarily consist of purchase orders for certain\ntechnical infrastructure as well as the non-cancelable portion or the minimum cancellation fee in certain agreements\nrelated to commitments to purchase licenses, including content licenses, inventory, and network capacity. For those\nagreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities\nand/or pricing as of March 31, 2025. In certain instances, the amount of our contractual obligations may change\nbased on the expected timing of order fulfillment from our suppliers. For more information related to our content\nlicenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report\non Form 10-Q.\nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and\nenergy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar\ncommitment. The amounts to be paid under these agreements are based on the actual volumes to be generated\nand are not readily determinable.\nWe may experience increases in the costs associated with our purchase commitments and other contractual\nobligations as a result of ongoing developments surrounding international trade. For details on risks related to our\nmanufacturing and supply chain and other risks, refer to Part I, Item 1A, \"Risk Factors\" in our Annual Report on\nForm 10-K for the fiscal year ending December 31, 2024.\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for\n$32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in\n2026, subject to customary closing conditions, including the receipt of regulatory approvals. For additional\ninformation, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly\nReport on Form 10-Q.\nCritical Accounting Estimates\nSee Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended\nDecember 31, 2024.\nAvailable Information\nOur website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor.\nAccess to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and\nour Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of\ncharge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov.\nWe webcast via our investor relations YouTube channel and website our earnings calls and certain events we\nparticipate in or host with members of the investment community. Our investor relations website also provides\n45",
      "title_page_text": "UNITED STATES\nSECURITIES AND EXCHANGE COMMISSION\nWashington, D.C. 20549\n________________________________________________________________________________________\nFORM 10-Q\n________________________________________________________________________________________\n(Mark One)\n☒ QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the quarterly period ended March 31, 2025\nOR\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the transition period from _______ to _______\nCommission file number: 001-37580\n________________________________________________________________________________________\nAlphabet Inc.\n(Exact name of registrant as specified in its charter)\n________________________________________________________________________________________\nDelaware 61-1767919\n(State or other jurisdiction of incorporation or organization) (I.R.S. Employer Identification Number)\n1600 Amphitheatre Parkway\nMountain View, CA 94043\n(Address of principal executive offices, including zip code)\n(650) 253-0000\n(Registrant's telephone number, including area code)\nSecurities registered pursuant to Section 12(b) of the Act:\nTitle of each class Trading Symbol(s) Name of each exchange on which registered\nClass A Common Stock, $0.001 par value GOOGL Nasdaq Stock Market LLC\n(Nasdaq Global Select Market)\nClass C Capital Stock, $0.001 par value GOOG Nasdaq Stock Market LLC\n(Nasdaq Global Select Market)\n________________________________________________________________________________________\nIndicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities\nExchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such\nreports), and (2) has been subject to such filing requirements for the past 90 days. Yes ☒ No ☐\nIndicate by check mark whether the registrant has submitted electronically every Interactive Data File required to be submitted\npursuant to Rule 405 of Regulation S-T (§232.405 of this chapter) during the preceding 12 months (or for such shorter period\nthat the registrant was required to submit such files). Yes ☒ No ☐\nIndicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, a smaller\nreporting company, or an emerging growth company. See the definitions of “large accelerated filer,” “accelerated filer,” “smaller\nreporting company,” and \"emerging growth company\" in Rule 12b-2 of the Exchange Act.\nLarge accelerated filer ☒ Accelerated filer ☐\nNon-accelerated filer ☐ Smaller reporting company ☐\nEmerging growth company ☐\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for\ncomplying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐\nIndicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes ☐ No\n☒\nAs of April 17, 2025, there were 5,820 million shares of Alphabet’s Class A stock outstanding, 856 million shares of Alphabet's\nClass B stock outstanding, and 5,459 million shares of Alphabet's Class C stock outstanding.",
      "analysis_income": "### Step 1: Markdown Table\n\n| Indicator                  | Prior Period (2024) | Current Period (2025) | YoY Change       |\n|----------------------------|---------------------|-----------------------|------------------|\n| Net Income                 | $23,662 million     | $34,540 million       | +$10,878 million |\n| Comprehensive Income       | $23,225 million     | $35,254 million       | +$12,029 million |\n| Other Comprehensive Income | $(437) million      | $714 million          | +$1,151 million  |\n\n### Step 2: Analyst Comments\n\n- **Profitability Trends**: Alphabet Inc. demonstrated a significant increase in profitability, with net income rising by approximately 46% year-over-year, driven by strong revenue growth and a substantial increase in other income.\n  \n- **Capital Return Strategies**: The financial summary does not provide specific details on stock repurchases or dividends paid, indicating a potential area for further investigation regarding the company's capital return strategies.\n\n- **Changes in Balance Sheet Strength or Equity**: The substantial improvement in comprehensive income, primarily due to a positive swing in other comprehensive income, suggests enhanced balance sheet strength and potential resilience against foreign currency and investment fluctuations.",
      "analysis_cashflow": "**Step 1: Output a Markdown Table**\n\n| Indicator                             | Prior Period | Current Period | YoY Change  |\n|---------------------------------------|--------------|----------------|-------------|\n| Net Cash Provided by Operating Activities | $28,848      | $36,150        | +25.3%      |\n| Net Cash Used in Investing Activities | $(8,564)     | $(16,194)      | -89.1%      |\n| Net Cash Used in Financing Activities | $(19,714)    | $(20,201)      | -2.5%       |\n| Free Cash Flow                        | $16,836      | $18,953        | +12.6%      |\n| Capital Expenditures (CapEx)          | $(12,012)    | $(17,197)      | -43.2%      |\n| Share Repurchases                     | $(15,696)    | $(15,068)      | +4.0%       |\n| Dividends Paid                        | $0           | $(2,434)       | — *(New)*   |\n| Net Change in Cash and Cash Equivalents | $445         | $(202)         | -145.4%     |\n\n**Step 2: Write 3 Bullet-Point Analyst Comments**\n\n- Alphabet Inc. demonstrated strong core cash generation with a 25.3% increase in net cash provided by operating activities, indicating robust operational performance and efficient working capital management.\n- The company significantly increased its capital expenditures by 43.2%, reflecting strategic investments in property and equipment, which may support future growth but also contributed to a substantial increase in cash used in investing activities.\n- Despite initiating dividend payments and maintaining substantial share repurchases, Alphabet's liquidity position slightly weakened, as evidenced by a net decrease in cash and cash equivalents, highlighting the impact of increased capital allocation activities on cash reserves.",
      "analysis_mdna": "- Alphabet's revenues increased by 12% year-over-year to $90.2 billion, driven by a 10% increase in Google Services and a 28% increase in Google Cloud revenues.\n- Operating income rose by 20% to $30.6 billion, with operating margins improving from 32% to 34%, primarily due to revenue growth outpacing cost increases.\n- Alphabet announced a $32 billion acquisition of Wiz, a cloud security platform, expected to close in 2026, which will enhance Google Cloud's security offerings.\n- The company repurchased $15.3 billion in shares during the quarter and increased its quarterly dividend by 5% to $0.21 per share, reflecting strong capital return to shareholders.\n- Google Cloud's operating income more than doubled, increasing by $1.3 billion, highlighting significant growth in infrastructure services and strategic focus on cloud expansion."
    }
  },
  {
    "extract_title": {
      "pdf_path": "C:/Users/Yi/OneDrive/Desktop/UChicago25Spring/FinAgent/goog-10-q-q1-2025.pdf",
      "income_text": "Table of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF INCOME\n(in millions, except per share amounts; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nRevenues $ 80,539 $ 90,234\nCosts and expenses:\nCost of revenues 33,712 36,361\nResearch and development 11,903 13,556\nSales and marketing 6,426 6,172\nGeneral and administrative 3,026 3,539\nTotal costs and expenses 55,067 59,628\nIncome from operations 25,472 30,606\nOther income (expense), net 2,843 11,183\nIncome before income taxes 28,315 41,789\nProvision for income taxes 4,653 7,249\nNet income $ 23,662 $ 34,540\nBasic net income per share (Note 12) $ 1.91 $ 2.84\nDiluted net income per share (Note 12) $ 1.89 $ 2.81\nSee accompanying notes.\n6\nTable of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nNet income $ 23,662 $ 34,540\nOther comprehensive income (loss):\nChange in foreign currency translation adjustment, net of income tax benefit\n(expense) of $(18) and $45 (503) 663\nAvailable-for-sale investments:\nChange in net unrealized gains (losses) (360) 645\nLess: reclassification adjustment for net (gains) losses included in net\nincome 311 (84)\nNet change, net of income tax benefit (expense) of $14 and $(159) (49) 561\nCash flow hedges:\nChange in net unrealized gains (losses) 186 (313)\nLess: reclassification adjustment for net (gains) losses included in net\nincome (71) (197)\nNet change, net of income tax benefit (expense) of $(23) and $131 115 (510)\nOther comprehensive income (loss) (437) 714\nComprehensive income $ 23,225 $ 35,254\nSee accompanying notes.\n7",
      "cashflow_text": "Table of Contents Alphabet Inc.\nAlphabet Inc.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions; unaudited)\nThree Months Ended\nMarch 31,\n2024 2025\nOperating activities\nNet income $ 23,662 $ 34,540\nAdjustments:\nDepreciation of property and equipment 3,413 4,487\nStock-based compensation expense 5,264 5,516\nDeferred income taxes 419 (1,152)\nLoss (gain) on debt and equity securities, net (1,781) (9,960)\nOther 334 481\nChanges in assets and liabilities, net of effects of acquisitions:\nAccounts receivable, net 3,167 1,638\nIncome taxes, net 3,011 7,197\nOther assets (1,000) (1,288)\nAccounts payable (2,124) (880)\nAccrued expenses and other liabilities (5,054) (5,045)\nAccrued revenue share (322) 116\nDeferred revenue (141) 500\nNet cash provided by operating activities 28,848 36,150\nInvesting activities\nPurchases of property and equipment (12,012) (17,197)\nPurchases of marketable securities (20,684) (18,453)\nMaturities and sales of marketable securities 24,985 20,345\nPurchases of non-marketable securities (1,206) (958)\nMaturities and sales of non-marketable securities 313 259\nAcquisitions, net of cash acquired, and purchases of intangible assets (61) (340)\nOther investing activities 101 150\nNet cash used in investing activities (8,564) (16,194)\nFinancing activities\nNet payments related to stock-based award activities (2,929) (3,110)\nRepurchases of stock (15,696) (15,068)\nDividend payments 0 (2,434)\nProceeds from issuance of debt, net of costs 1,982 4,532\nRepayments of debt (3,079) (4,521)\nProceeds from sale of interest in consolidated entities, net 8 400\nNet cash used in financing activities (19,714) (20,201)\nEffect of exchange rate changes on cash and cash equivalents (125) 43\nNet increase (decrease) in cash and cash equivalents 445 (202)\nCash and cash equivalents at beginning of period 24,048 23,466\nCash and cash equivalents at end of period $ 24,493 $ 23,264\nSee accompanying notes.\n9",
      "mdna_text": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nPlease read the following discussion and analysis of our financial condition and results of operations together\nwith \"Note About Forward-Looking Statements\" and our consolidated financial statements and related notes\nincluded under Item 1 of this Quarterly Report on Form 10-Q as well as our Annual Report on Form 10-K for the\nfiscal year ended December 31, 2024, including Part I, Item 1A \"Risk Factors.\"\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments,\nGoogle Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further\ndetails on our segments, see Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this\nQuarterly Report on Form 10-Q.\nRevenues and Monetization Metrics\nWe generate revenues by delivering relevant, cost-effective online advertising; cloud-based solutions that\nprovide enterprise customers of all sizes with infrastructure, platform services, and applications; sales of other\nproducts and services, such as fees received for subscription-based products, apps and in-app purchases, and\ndevices. For additional information on how we recognize revenue, see Note 1 of the Notes to Consolidated\nFinancial Statements included in Part II, Item 8 in our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024.\nIn addition to the long-term trends and their financial effect on our business discussed in \"Trends in Our\nBusiness and Financial Effect\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended\nDecember 31, 2024, fluctuations in our revenues have been and may continue to be affected by a combination of\nfactors, including:\n• changes in foreign currency exchange rates;\n• changes in pricing, such as those resulting from changes in fee structures, discounts, and customer\nincentives;\n• general economic conditions and various external dynamics, including geopolitical events, regulations, and\nother measures and their effect on advertiser, consumer, and enterprise spending;\n• new product, service, and market launches; and\n• seasonality.\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources\n(\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to\nbe, affected by other factors unique to each set of revenues, as described below.\nGoogle Services\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and\ndevices revenues.\nGoogle Advertising\nGoogle advertising revenues are comprised of the following:\n• Google Search & other, which includes revenues generated on Google search properties (including\nrevenues from traffic generated by search distribution partners who use Google.com as their default search\nin browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and\nGoogle Play;\n• YouTube ads, which includes revenues generated on YouTube properties; and\n• Google Network, which includes revenues generated on Google Network properties participating in AdMob,\nAdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our\nadvertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while\nimpressions and cost-per-impression pertain to traffic on our Google Network properties.\n32\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google\nsearch properties and other Google owned and operated properties including Gmail, Google Maps, and Google\nPlay. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the\naverage amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in\nAdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based\nrevenues divided by our total number of impressions, and represents the average amount we charge advertisers for\neach impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring,\ngathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues\ngenerated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google\nSearch & other properties and the change in impressions and cost-per-impression on Google Network properties\nand the correlation between these items have been, and may continue to be, affected by factors in addition to the\ngeneral factors described above, such as:\n• advertiser competition for keywords;\n• changes in advertising quality, formats, delivery or policy;\n• changes in device mix;\n• seasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as\ntraditional retail seasonality; and\n• traffic growth in emerging markets compared to more mature markets and across various verticals and\nchannels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\n• consumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV,\nYouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\n• platforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\n• devices, which primarily include sales of the Pixel family of devices; and\n• other products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be,\naffected by factors in addition to the general factors described above, such as changes in customer usage and\ndemand, number of subscribers, and the timing of product launches.\nGoogle Cloud\nGoogle Cloud revenues are comprised of the following:\n• Google Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure,\nplatform, and other services. These services provide access to solutions such as AI offerings including our\nAI infrastructure, Vertex AI platform, and Gemini for Google Cloud: cybersecurity; and data and analytics;\n• Google Workspace, which includes subscriptions for cloud-based communication and collaboration tools for\nenterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for\nGoogle Workspace; and\n• other enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition\nto the general factors described above, such as changes in customer usage and demand.\nOther Bets\nRevenues from Other Bets are generated primarily from the sale of healthcare-related services and internet\nservices.\n33\nCosts and Expenses\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses\ninclude costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs\nand expenses, including those associated with the operation of our technical infrastructure as well as components\nof our operating expenses, are generally less variable in nature and may not correlate to changes in revenue.\nAdditionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount\ndue to factors such as annual SBC awards that generally vest over four years.\nCost of Revenues\nCost of revenues is comprised of TAC and other costs of revenues.\n• TAC includes:\n◦ amounts paid to our distribution partners who make available our search access points and\nservices. Our distribution partners include browser providers, mobile carriers, original equipment\nmanufacturers, and software developers; and\n◦ amounts paid to Google Network partners primarily for ads displayed on their properties.\n• Other cost of revenues primarily includes:\n◦ content acquisition costs, which are payments to content providers from whom we license video\nand other content for distribution, primarily related to YouTube (we pay fees to these content\nproviders based on revenues generated, subscriber counts, or a flat fee);\n◦ depreciation expense related to our technical infrastructure;\n◦ employee compensation expenses related to our technical infrastructure and other operations such\nas content review and customer and product support;\n◦ inventory and other costs related to the devices we sell; and\n◦ other technical infrastructure operations costs, including network capacity, energy, and equipment\ncosts.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly\nhigher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties,\nbecause most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our\nGoogle Network partners.\nOperating Expenses\nOperating expenses are generally incurred during our normal course of business, which we categorize as\neither R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\n• depreciation;\n• employee compensation expenses for engineering and technical employees responsible for R&D related to\nour existing and new products and services; and\n• third-party services fees primarily relating to consulting and outsourced services in support of our\nengineering and product development efforts.\nThe main components of our sales and marketing expenses are:\n• employee compensation expenses for employees engaged in sales and marketing, sales support, and\ncertain customer service functions; and\n• spend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\n• employee compensation expenses for employees in finance, human resources, information technology,\nlegal, and other administrative support functions;\n• expenses relating to legal and other matters, including certain fines and settlements; and\n34\n• third-party services fees, including audit, consulting, outside legal, and other outsourced administrative\nservices.\nOther Income (Expense), Net\nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains\n(losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees,\nand income (loss) and impairment from our equity method investments.\nFor additional information, including how we account for our investments and factors that can drive fluctuations\nin the value of our investments, see Note 1 of the Notes to Consolidated Financial Statements included in Part II,\nItem 8 and Item 7A, “Quantitative and Qualitative Disclosures About Market Risk” in our Annual Report on Form 10-\nK for the fiscal year ended December 31, 2024 as well as Note 3 of the Notes to Consolidated Financial Statements\nincluded in Item 1 of this Quarterly Report on Form 10-Q.\nProvision for Income Taxes\nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes\nincurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve\nprovisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nFor additional information, see Note 1 of the Notes to Consolidated Financial Statements included in Part II,\nItem 8 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 as well as Note 14 of the\nNotes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nExecutive Overview\nThe following table summarizes consolidated financial results (in millions, except per share information and\npercentages):\nThree Months Ended\nMarch 31,\n2024 2025 $ Change % Change\nConsolidated revenues $ 80,539 $ 90,234 $ 9,695 12 %\nChange in consolidated constant currency revenues(1) 14 %\nCost of revenues $ 33,712 $ 36,361 $ 2,649 8 %\nOperating expenses $ 21,355 $ 23,267 $ 1,912 9 %\nOperating income $ 25,472 $ 30,606 $ 5,134 20 %\nOperating margin 32 % 34 % 2 %\nOther income (expense), net $ 2,843 $ 11,183 $ 8,340 293 %\nNet income $ 23,662 $ 34,540 $ 10,878 46 %\nDiluted EPS (2) $ 1.89 $ 2.81 $ 0.92 49 %\n(1) See \"Use of Non-GAAP Constant Currency Information\" below for details relating to our use of constant currency\ninformation.\n(2) For additional information on the calculation of diluted EPS, see Note 12 of the Notes to Consolidated Financial Statements\nincluded in Item 1 of this Quarterly Report on Form 10-Q.\n• Revenues were $90.2 billion, an increase of 12% year over year, primarily driven by an increase in Google\nServices revenues of $6.9 billion, or 10%, and an increase in Google Cloud revenues of $2.7 billion, or\n28%.\n• Total constant currency revenues, which exclude the effect of hedging, increased 14% year over year.\n• Cost of revenues was $36.4 billion, an increase of 8% year over year, primarily driven by increases in\ncontent acquisition costs, TAC, and depreciation expense.\n35\n• Operating expenses were $23.3 billion, an increase of 9% year over year, primarily driven by increases in\ndepreciation expense, employee compensation expenses, and other technical infrastructure operations\ncosts.\nOther Information:\n• In March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for\n$32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to\nclose in 2026, subject to customary closing conditions, including the receipt of regulatory approvals. Upon\nthe close of the acquisition, Wiz will be part of the Google Cloud segment.\n• In April 2025, the Board of Directors of Alphabet declared a quarterly cash dividend of $0.21 representing a\n5% increase from the previous quarterly dividend of $0.20. The dividend is payable on June 16, 2025 to\nstockholders of record for each of the company’s Class A, Class B, and Class C shares as of June 9, 2025.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item\n1 of this Quarterly Report on Form 10-Q\n• Repurchases of Class A and Class C shares were $2.8 billion and $12.5 billion, respectively, totaling $15.3\nbillion for the three months ended March 31, 2025. For additional information, see Note 11 of the Notes to\nConsolidated Financial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\n• OI&E of $11.2 billion for the three months ended March 31, 2025 included an $8.0 billion unrealized gain on\nour non-marketable equity securities related to our investment in a private company.\n• Operating cash flow was $36.2 billion for the three months ended March 31, 2025.\n• Capital expenditures, which primarily reflected investments in technical infrastructure, were $17.2 billion for\nthe three months ended March 31, 2025.\n• As of March 31, 2025, we had 185,719 employees.\nWe are monitoring ongoing developments surrounding international trade and the macroeconomic\nenvironment. As a result of volatility in international trade and financial markets, we may experience direct and\nindirect effects on our business, operations, and financial results. Our past results may not be indicative of our\nfuture performance, and our financial results may differ materially from historical trends.\nFinancial Results\nRevenues\nThe following table presents revenues by type (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nGoogle Search & other $ 46,156 $ 50,702\nYouTube ads 8,090 8,927\nGoogle Network 7,413 7,256\nGoogle advertising 61,659 66,885\nGoogle subscriptions, platforms, and devices 8,739 10,379\nGoogle Services total 70,398 77,264\nGoogle Cloud 9,574 12,260\nOther Bets 495 450\nHedging gains (losses) 72 260\nTotal revenues $ 80,539 $ 90,234\n36\nGoogle Services\nGoogle advertising revenues\nGoogle Search & other\nGoogle Search & other revenues increased $4.5 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The overall growth was driven by interrelated factors including increases in\nsearch queries resulting from growth in user adoption and usage on mobile devices; growth in advertiser spending;\nand improvements we have made in ad formats and delivery.\nYouTube ads\nYouTube ads revenues increased $837 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025. The growth was driven by our direct response advertising products followed by our\nbrand advertising products, both of which benefited from increased spending by our advertisers.\nGoogle Network\nGoogle Network revenues decreased $157 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025, primarily due to the unfavorable effect of foreign currency exchange rates and a\ndecrease in Google Ad Manager and AdMob revenues. These decreases were partially offset by an increase in\nAdSense revenues.\nMonetization Metrics\nThe following table presents changes in monetization metrics for Google Search & other revenues (paid clicks\nand cost-per-click) and Google Network revenues (impressions and cost-per-impression), expressed as a\npercentage, from three months ended March 31, 2024 to three months ended March 31, 2025:\nGoogle Search & other\nPaid clicks change 2 %\nCost-per-click change 7 %\nGoogle Network\nImpressions change (5) %\nCost-per-impression change 4 %\nChanges in paid clicks and impressions are driven by a number of interrelated factors, including changes in\nadvertiser spending; ongoing product and policy changes; and, as it relates to paid clicks, fluctuations in search\nqueries resulting from changes in user adoption and usage, primarily on mobile devices.\nChanges in cost-per-click and cost-per-impression are driven by a number of interrelated factors including\nchanges in device mix, geographic mix, advertiser spending, ongoing product and policy changes, product mix,\nproperty mix, and changes in foreign currency exchange rates.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues increased $1.6 billion from the three months ended\nMarch 31, 2024 to the three months ended March 31, 2025. The growth was primarily driven by an increase in\nsubscription revenues. The increase in subscription revenues was primarily due to growth in the number of paid\nsubscribers across both YouTube services and Google One.\nGoogle Cloud\nGoogle Cloud revenues increased $2.7 billion from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily driven by growth in Google Cloud Platform largely from infrastructure\nservices.\n37\nRevenues by Geography\nThe following table presents revenues by geography as a percentage of revenues, determined based on the\naddresses of our customers:\nThree Months Ended\nMarch 31,\n2024 2025\nUnited States 48 % 49 %\nEMEA 30 % 29 %\nAPAC 16 % 16 %\nOther Americas 6 % 6 %\nHedging gains (losses) 0 % 0 %\nFor additional information, see Note 2 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nUse of Non-GAAP Constant Currency Information\nInternational revenues, which represent a significant portion of our revenues, are generally transacted in\nmultiple currencies and therefore are affected by fluctuations in foreign currency exchange rates.\nThe effect of currency exchange rates on our business is an important factor in understanding period-to-period\ncomparisons. We use non-GAAP constant currency revenues (\"constant currency revenues\") and non-GAAP\npercentage change in constant currency revenues (\"percentage change in constant currency revenues\") for\nfinancial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe\nthe presentation of results on a constant currency basis in addition to GAAP results helps improve the ability to\nunderstand our performance, because it excludes the effects of foreign currency volatility that are not indicative of\nour core operating results.\nConstant currency information compares results between periods as if exchange rates had remained constant\nperiod over period. We define constant currency revenues as revenues excluding the effect of foreign currency\nexchange rate movements (\"FX Effect\") as well as hedging activities, which are recognized at the consolidated\nlevel. We use constant currency revenues to determine the constant currency revenue percentage change on a\nyear-on-year basis. Constant currency revenues are calculated by translating current period revenues using prior\nyear comparable period exchange rates, as well as excluding any hedging effects realized in the current period.\nConstant currency revenue percentage change is calculated by determining the change in current period\nrevenues over prior year comparable period revenues where current period foreign currency revenues are\ntranslated using prior year comparable period exchange rates and hedging effects are excluded from revenues of\nboth periods.\nThese results should be considered in addition to, not as a substitute for, results reported in accordance with\nGAAP. Results on a constant currency basis, as we present them, may not be comparable to similarly titled\nmeasures used by other companies and are not a measure of performance presented in accordance with GAAP.\n38\nThe following table presents the foreign currency exchange effect on international revenues and total revenues\n(in millions, except percentages):\nThree Months Ended March 31, 2025\n% Change from Prior Period\nThree Months Ended\nMarch 31, Constant Less Constant\nLess FX Currency As Hedging Less FX Currency\n2024 2025 Effect Revenues Reported Effect Effect Revenues\nUnited States $ 38,737 $ 43,964 $ 0 $ 43,964 13 % 0 % 13 %\nEMEA 23,788 25,923 (724) 26,647 9 % (3) % 12 %\nAPAC 13,289 14,854 (381) 15,235 12 % (3) % 15 %\nOther Americas 4,653 5,233 (500) 5,733 12 % (11) % 23 %\nRevenues, excluding hedging\neffect 80,467 89,974 (1,605) 91,579 12 % (2) % 14 %\nHedging gains (losses) 72 260\nTotal revenues(1) $ 80,539 $ 90,234 $ 91,579 12 % 0 % (2) % 14 %\n(1) Total constant currency revenues of $91.6 billion for the three months ended March 31, 2025 increased $11.1 billion\ncompared to $80.5 billion in revenues, excluding hedging effect, for the three months ended March 31, 2024.\nEMEA revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the euro.\nAPAC revenue growth was unfavorably affected by changes in foreign currency exchange rates, primarily due\nto the U.S. dollar strengthening relative to the Japanese yen, Australian dollar, and South Korean won.\nOther Americas revenue growth was unfavorably affected by changes in foreign currency exchange rates,\nprimarily due to the U.S. dollar strengthening relative to the Brazilian real.\nCosts and Expenses\nCost of Revenues\nThe following table presents cost of revenues, including TAC (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nTAC $ 12,946 $ 13,748\nOther cost of revenues 20,766 22,613\nTotal cost of revenues $ 33,712 $ 36,361\nTotal cost of revenues as a percentage of revenues 42 % 40 %\nCost of revenues increased $2.6 billion from the three months ended March 31, 2024 to the three months\nended March 31, 2025 due to an increase in other cost of revenues and TAC of $1.8 billion and $802 million,\nrespectively.\nThe increase in TAC from the three months ended March 31, 2024 to the three months ended March 31, 2025\nwas largely due to an increase in TAC paid to distribution partners, primarily driven by growth in revenues subject to\nTAC. The TAC rate decreased from 21.0% to 20.6% from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to a revenue mix shift from Google Network properties to Google\nSearch & other properties. The TAC rate on Google Search & other revenues increased from the three months\nended March 31, 2024 to the three months ended March 31, 2025 primarily due to increases related to mobile\nsearches, which carries higher TAC because more mobile searches are channeled through paid access points. The\nTAC rate on Google Network revenues decreased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to a combination of factors, none of which were individually significant.\nThe increase in other cost of revenues from the three months ended March 31, 2024 to the three months\nended March 31, 2025 was primarily due to increases in content acquisition costs, largely for YouTube,\ndepreciation expense, and other technical infrastructure operations costs.\n39\nResearch and Development\nThe following table presents R&D expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nResearch and development expenses $ 11,903 $ 13,556\nResearch and development expenses as a percentage of revenues 15 % 15 %\nR&D expenses increased $1.7 billion from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025, primarily driven by increases in employee compensation expenses of $697 million and depreciation\nexpense of $491 million.\nSales and Marketing\nThe following table presents sales and marketing expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nSales and marketing expenses $ 6,426 $ 6,172\nSales and marketing expenses as a percentage of revenues 8 % 7 %\nSales and marketing expenses decreased $254 million from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025 primarily driven by a decrease in employee compensation expenses of $307\nmillion.\nGeneral and Administrative\nThe following table presents general and administrative expenses (in millions, except percentages):\nThree Months Ended\nMarch 31,\n2024 2025\nGeneral and administrative expenses $ 3,026 $ 3,539\nGeneral and administrative expenses as a percentage of revenues 4 % 4 %\nGeneral and administrative expenses increased $513 million from the three months ended March 31, 2024 to\nthe three months ended March 31, 2025, primarily driven by an increase in charges related to legal and other\nmatters of $292 million and a combination of other factors, none of which were individually significant.\nSegment Profitability\nWe report our segment results as Google Services, Google Cloud, and Other Bets. Additionally, certain costs\nare not allocated to our segments because they represent Alphabet-level activities. For further details on our\nsegments, Note 15 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report on\nForm 10-Q.\n40\nThe following table presents segment operating income (loss) (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nOperating income (loss):\nGoogle Services $ 27,897 $ 32,682\nGoogle Cloud 900 2,177\nOther Bets (1,020) (1,226)\nAlphabet-level activities(1) (2,305) (3,027)\nTotal income from operations $ 25,472 $ 30,606\n(1) In addition to the costs included in Alphabet-level activities, hedging gains (losses) related to revenue were $72 million and\n$260 million for the three months ended March 31, 2024 and 2025, respectively. Alphabet-level activities include all of the\ncharges related to employee severance and office space charges.\nGoogle Services\nGoogle Services operating income increased $4.8 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The increase in operating income was primarily driven by an increase in\nrevenues, partially offset by increases in content acquisition costs and TAC.\nGoogle Cloud\nGoogle Cloud operating income increased $1.3 billion from the three months ended March 31, 2024 to the\nthree months ended March 31, 2025. The increase in operating income was primarily driven by an increase in\nrevenues, partially offset by increases in usage costs for technical infrastructure and employee compensation\nexpenses.\nOther Bets\nOther Bets operating loss increased $206 million from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025. The increase in operating loss was due to a combination of factors, none of which\nwere individually significant.\nOther Income (Expense), Net\nThe following table presents OI&E (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nInterest income $ 1,061 $ 1,001\nInterest expense (94) (34)\nForeign currency exchange gain (loss), net (238) (106)\nGain (loss) on debt securities, net (462) 202\nGain (loss) on equity securities, net 2,243 9,758\nPerformance fees 104 (40)\nIncome (loss) and impairment from equity method investments, net (26) (22)\nOther 255 424\nOther income (expense), net $ 2,843 $ 11,183\nOI&E, net increased $8.3 billion from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025 primarily due to an increase in net gains on equity securities. The net gains on equity securities\nwere due to net unrealized gains on non-marketable equity securities driven by fair value adjustments related to\nobservable transactions.\nFor additional information, see Note 3 and Note 7 of the Notes to Consolidated Financial Statements included\nin Item 1 of this Quarterly Report on Form 10-Q.\n41\nProvision for Income Taxes\nThe following table presents provision for income taxes (in millions, except effective tax rate):\nThree Months Ended\nMarch 31,\n2024 2025\nIncome before provision for income taxes $ 28,315 $ 41,789\nProvision for income taxes $ 4,653 $ 7,249\nEffective tax rate 16.4 % 17.3 %\nThe effective tax rate increased from the three months ended March 31, 2024 to the three months ended\nMarch 31, 2025. This increase was primarily due to lower effective tax rate impacts in the U.S. federal Foreign\nDerived Intangible Income tax deduction, R&D credits, and stock-based compensation-related tax benefits.\nThe OECD is coordinating negotiations among more than 140 countries with the goal of achieving consensus\naround substantial changes to international tax policies, including the implementation of a minimum global effective\ntax rate of 15%. Some countries have already implemented the legislation effective January 1, 2024, and we expect\nothers to follow, however this did not have a material effect on our income tax provision for the period ending\nMarch 31, 2025.\nFinancial Condition\nCash, Cash Equivalents, and Marketable Securities\nAs of March 31, 2025, we had $95.3 billion in cash, cash equivalents, and short-term marketable securities.\nCash equivalents and marketable securities are comprised of time deposits, money market funds, highly liquid\ngovernment bonds, corporate debt securities, mortgage-backed and asset-backed securities, and marketable equity\nsecurities.\nSources, Uses of Cash and Related Trends\nOur principal sources of liquidity are cash, cash equivalents, and marketable securities, as well as the cash\nflow that we generate from operations. The primary use of capital continues to be to invest for the long-term growth\nof the business. We regularly evaluate our cash and capital structure, including the size, pace, and form of capital\nreturn to stockholders.\nThe following table presents cash flows (in millions):\nThree Months Ended\nMarch 31,\n2024 2025\nNet cash provided by operating activities $ 28,848 $ 36,150\nNet cash used in investing activities $ (8,564) $ (16,194)\nNet cash used in financing activities $ (19,714) $ (20,201)\nCash Provided by Operating Activities\nOur largest source of cash provided by operations are advertising revenues generated by Google Search &\nother properties, Google Network properties, and YouTube properties. In Google Services, we also generate cash\nthrough consumer subscriptions, the sale of apps and in-app purchases, and devices. In Google Cloud, we\ngenerate cash through consumption-based fees and subscriptions for infrastructure, platform, applications, and\nother cloud services.\nOur primary uses of cash from operating activities include payments to distribution and Google Network\npartners, to employees for compensation, and to content providers. Other uses of cash from operating activities\ninclude payments to suppliers for devices, to tax authorities for income taxes, and other general corporate\nexpenditures.\nNet cash provided by operating activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to an increase in cash received from customers, partially offset by an increase in\ncash payments for cost of revenues and operating expenses.\n42\nCash Used in Investing Activities\nCash provided by investing activities consists primarily of maturities and sales of investments in marketable\nand non-marketable securities. Cash used in investing activities consists primarily of purchases of marketable and\nnon-marketable securities, purchases of property and equipment, and payments for acquisitions.\nNet cash used in investing activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 primarily due to an increase in purchases of property and equipment and a decrease\nin maturities and sales of marketable securities, partially offset by a decrease in purchases of marketable securities.\nThe increase in purchases of property and equipment is primarily driven by investments in technical infrastructure.\nCash Used in Financing Activities\nCash provided by financing activities consists primarily of proceeds from issuance of debt and proceeds from\nthe sale of interests in consolidated entities. Cash used in financing activities consists primarily of repurchases of\nstock, net payments related to stock-based award activities, payment of dividends, and repayments of debt.\nNet cash used in financing activities increased from the three months ended March 31, 2024 to the three\nmonths ended March 31, 2025 due to dividend payments, partially offset by an increase in proceeds from issuance\nof debt, net of repayments.\nLiquidity and Material Cash Requirements\nWe expect existing cash, cash equivalents, short-term marketable securities, and cash flows from operations\nand financing activities to continue to be sufficient to fund our operating activities and cash commitments for\ninvesting and financing activities for at least the next 12 months, and thereafter for the foreseeable future.\nCapital Expenditures and Leases\nWe make investments in land, buildings, and servers and network equipment through purchases of property\nand equipment and lease arrangements to provide capacity for the growth of our services and products.\nCapital Expenditures\nOur capital investments in property and equipment consist primarily of the following major categories:\n• technical infrastructure, which consists of our investments in servers and network equipment for computing,\nstorage, and networking requirements for ongoing business activities, including AI, and data center land and\nbuilding construction; and\n• office facilities, ground-up development projects, and building improvements (also referred to as \"fit-outs\").\nAssets not yet in service are those that are not ready for our intended use, including assets in the process of\nconstruction or assembly, and consists primarily of technical infrastructure. The time frame from date of purchase to\nplacement in service of these assets may extend from months to years. For example, our data center construction\nprojects are generally multi-year projects with multiple phases, where we acquire land and buildings, construct\nbuildings, and secure and install servers and network equipment.\nDuring the three months ended March 31, 2024 and 2025, we spent $12.0 billion and $17.2 billion on capital\nexpenditures, respectively. We expect to increase, relative to 2024, our investment in our technical infrastructure,\nincluding servers, network equipment, and data centers, to support the growth of our business and our long-term\ninitiatives, in particular in support of AI products and services. Depreciation of our property and equipment\ncommences when such assets are ready for our intended use. For the three months ended March 31, 2024 and\n2025, depreciation on property and equipment was $3.4 billion and $4.5 billion, respectively.\nLeases\nAs of March 31, 2025, the amount of total future lease payments under operating and finance leases was\n$17.0 billion and $2.5 billion, respectively.\nAs of March 31, 2025, we have entered into leases primarily related to data centers that have not yet\ncommenced with future lease payments of $17.3 billion. These leases will commence between 2025 and 2031 with\nnon-cancelable lease terms between one and 25 years.\n43\nFor additional information on leases, see Note 4 of the Notes to Consolidated Financial Statements included in\nItem 1 of this Quarterly Report on Form 10-Q.\nFinancing\nWe have a short-term debt financing program of up to $10.0 billion through the issuance of commercial paper.\nNet proceeds from this program are used for general corporate purposes. As of March 31, 2025, we had $2.5 billion\nof short-term commercial paper outstanding.\nAs of March 31, 2025, we had senior unsecured notes outstanding with a total carrying value of $11.9 billion.\nAs of March 31, 2025, we had $10.0 billion of revolving credit facilities, $4.0 billion expiring in April 2025 and\n$6.0 billion expiring in April 2028. In April 2025, we entered into a new $4.0 billion revolving credit facility expiring in\nApril 2026. Additionally, we terminated the $6.0 billion revolving credit facility expiring in April 2028 and entered into\na new $6.0 billion revolving credit facility expiring in April 2030. The interest rates for all credit facilities are\ndetermined based on a formula using certain market rates. No amounts have been borrowed under the credit\nfacilities.\nFor additional information, see Note 6 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nWe primarily utilize contract manufacturers for the assembly of our servers used in our technical infrastructure\nand devices we sell. We have agreements where we may purchase components directly from suppliers and then\nsupply these components to contract manufacturers for use in the assembly of the servers and devices. Certain of\nthese arrangements result in a portion of the cash received from and paid to the contract manufacturers to be\npresented as financing activities in the Consolidated Statements of Cash Flows included in Item 1 of this Quarterly\nReport on Form 10-Q.\nShare Repurchase Program\nDuring the three months ended March 31, 2025, we repurchased and subsequently retired 83 million shares\nfor $15.3 billion.\nIn April 2024, the Board of Directors of Alphabet authorized the company to repurchase up to $70.0 billion of its\nClass A and Class C shares. As of March 31, 2025, $29.5 billion remained available for Class A and Class C share\nrepurchases. In April 2025, the Board of Directors of Alphabet authorized the company to repurchase up to an\nadditional $70.0 billion of Class A and Class C shares.\nThe following table presents Class A and Class C shares repurchased and subsequently retired (in millions):\nThree Months Ended March 31, 2025\nShares Amount\nClass A share repurchases 15 $ 2,766\nClass C share repurchases 68 12,535\nTotal share repurchases(1) 83 $ 15,301\n(1) Shares repurchased include unsettled repurchases.\nFor additional information, see Note 11 of the Notes to Consolidated Financial Statements included in Item 1 of\nthis Quarterly Report on Form 10-Q.\nDividend Program\nIn the three months ended March 31, 2025, total cash dividends were $1.2 billion, $171 million, and $1.1 billion\nfor Class A, Class B, and Class C shares, respectively.\nIn April 2025, the Board of Directors of Alphabet declared a quarterly cash dividend of $0.21 representing a 5%\nincrease from the previous quarterly dividend of $0.20. The dividend is payable on June 16, 2025 to stockholders of\nrecord for each of the company’s Class A, Class B, and Class C shares as of June 9, 2025.\nThe company intends to pay quarterly cash dividends in the future, subject to review and approval by the\ncompany’s Board of Directors in its sole discretion.\n44\nEuropean Commission Fines\nIn 2018 and 2019, the EC announced decisions that certain actions taken by Google infringed European\ncompetition law and imposed fines of €4.3 billion ($5.1 billion as of June 30, 2018) and €1.5 billion ($1.7 billion as of\nMarch 20, 2019), respectively.\nIn September 2022, the General Court affirmed the EC decision but reduced the 2018 fine from €4.3 billion to\n€4.1 billion. We subsequently appealed the General Court's affirmation of the EC with the European Court of\nJustice, which remains pending.\nIn September 2024, the EU's General Court overturned the 2019 decision and annulled the €1.5 billion fine.\nThe EC has appealed the General Court's decision to the European Court of Justice.\nWe included the outstanding EC fines, including any under appeal, in accrued expenses and other current\nliabilities on our Consolidated Balance Sheets. For additional information, see Note 10 of the Notes to Consolidated\nFinancial Statements included in Item 1 of this Quarterly Report on Form 10-Q.\nTaxes\nAs of March 31, 2025, we had income taxes payable of $2.7 billion related to a one-time transition tax payable\nincurred as a result of the U.S. Tax Cuts and Jobs Act, which is due in 2025. We also had long-term taxes payable\nof $9.8 billion primarily related to uncertain tax positions as of March 31, 2025.\nPurchase Commitments and Other Contractual Obligations\nAs of March 31, 2025, we had material purchase commitments and other contractual obligations of $62.1\nbillion, of which $41.5 billion was short-term. These amounts primarily consist of purchase orders for certain\ntechnical infrastructure as well as the non-cancelable portion or the minimum cancellation fee in certain agreements\nrelated to commitments to purchase licenses, including content licenses, inventory, and network capacity. For those\nagreements with variable terms, we do not estimate the non-cancelable obligation beyond any minimum quantities\nand/or pricing as of March 31, 2025. In certain instances, the amount of our contractual obligations may change\nbased on the expected timing of order fulfillment from our suppliers. For more information related to our content\nlicenses, see Note 10 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly Report\non Form 10-Q.\nIn addition, we regularly enter into multi-year, non-cancellable agreements to purchase renewable energy and\nenergy attributes, such as renewable energy certificates. These agreements do not include a minimum dollar\ncommitment. The amounts to be paid under these agreements are based on the actual volumes to be generated\nand are not readily determinable.\nWe may experience increases in the costs associated with our purchase commitments and other contractual\nobligations as a result of ongoing developments surrounding international trade. For details on risks related to our\nmanufacturing and supply chain and other risks, refer to Part I, Item 1A, \"Risk Factors\" in our Annual Report on\nForm 10-K for the fiscal year ending December 31, 2024.\nPending Acquisition\nIn March 2025, we entered into a definitive agreement to acquire Wiz, a leading cloud security platform, for\n$32.0 billion, subject to closing adjustments, in an all-cash transaction. The acquisition of Wiz is expected to close in\n2026, subject to customary closing conditions, including the receipt of regulatory approvals. For additional\ninformation, see Note 8 of the Notes to Consolidated Financial Statements included in Item 1 of this Quarterly\nReport on Form 10-Q.\nCritical Accounting Estimates\nSee Part II, Item 7, \"Critical Accounting Estimates\" in our Annual Report on Form 10-K for the year ended\nDecember 31, 2024.\nAvailable Information\nOur website is located at www.abc.xyz, and our investor relations website is located at www.abc.xyz/investor.\nAccess to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and\nour Proxy Statements, and any amendments to these reports, is available on our investor relations website, free of\ncharge, after we file or furnish them with the SEC and they are available on the SEC's website at www.sec.gov.\nWe webcast via our investor relations YouTube channel and website our earnings calls and certain events we\nparticipate in or host with members of the investment community. Our investor relations website also provides\n45",
      "title_page_text": "UNITED STATES\nSECURITIES AND EXCHANGE COMMISSION\nWashington, D.C. 20549\n________________________________________________________________________________________\nFORM 10-Q\n________________________________________________________________________________________\n(Mark One)\n☒ QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the quarterly period ended March 31, 2025\nOR\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the transition period from _______ to _______\nCommission file number: 001-37580\n________________________________________________________________________________________\nAlphabet Inc.\n(Exact name of registrant as specified in its charter)\n________________________________________________________________________________________\nDelaware 61-1767919\n(State or other jurisdiction of incorporation or organization) (I.R.S. Employer Identification Number)\n1600 Amphitheatre Parkway\nMountain View, CA 94043\n(Address of principal executive offices, including zip code)\n(650) 253-0000\n(Registrant's telephone number, including area code)\nSecurities registered pursuant to Section 12(b) of the Act:\nTitle of each class Trading Symbol(s) Name of each exchange on which registered\nClass A Common Stock, $0.001 par value GOOGL Nasdaq Stock Market LLC\n(Nasdaq Global Select Market)\nClass C Capital Stock, $0.001 par value GOOG Nasdaq Stock Market LLC\n(Nasdaq Global Select Market)\n________________________________________________________________________________________\nIndicate by check mark whether the registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities\nExchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such\nreports), and (2) has been subject to such filing requirements for the past 90 days. Yes ☒ No ☐\nIndicate by check mark whether the registrant has submitted electronically every Interactive Data File required to be submitted\npursuant to Rule 405 of Regulation S-T (§232.405 of this chapter) during the preceding 12 months (or for such shorter period\nthat the registrant was required to submit such files). Yes ☒ No ☐\nIndicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, a smaller\nreporting company, or an emerging growth company. See the definitions of “large accelerated filer,” “accelerated filer,” “smaller\nreporting company,” and \"emerging growth company\" in Rule 12b-2 of the Exchange Act.\nLarge accelerated filer ☒ Accelerated filer ☐\nNon-accelerated filer ☐ Smaller reporting company ☐\nEmerging growth company ☐\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for\ncomplying with any new or revised financial accounting standards provided pursuant to Section 13(a) of the Exchange Act. ☐\nIndicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes ☐ No\n☒\nAs of April 17, 2025, there were 5,820 million shares of Alphabet’s Class A stock outstanding, 856 million shares of Alphabet's\nClass B stock outstanding, and 5,459 million shares of Alphabet's Class C stock outstanding.",
      "analysis_income": "### Step 1: Markdown Table\n\n| Indicator                  | Prior Period (2024) | Current Period (2025) | YoY Change       |\n|----------------------------|---------------------|-----------------------|------------------|\n| Net Income                 | $23,662 million     | $34,540 million       | +$10,878 million |\n| Comprehensive Income       | $23,225 million     | $35,254 million       | +$12,029 million |\n| Other Comprehensive Income | $(437) million      | $714 million          | +$1,151 million  |\n\n### Step 2: Analyst Comments\n\n- **Profitability Trends**: Alphabet Inc. demonstrated a significant increase in profitability, with net income rising by approximately 46% year-over-year, driven by strong revenue growth and a substantial increase in other income.\n  \n- **Capital Return Strategies**: The financial summary does not provide specific details on stock repurchases or dividends paid, indicating a potential area for further investigation regarding the company's capital return strategies.\n\n- **Changes in Balance Sheet Strength or Equity**: The substantial improvement in comprehensive income, primarily due to a positive swing in other comprehensive income, suggests enhanced balance sheet strength and potential resilience against foreign currency and investment fluctuations.",
      "analysis_cashflow": "**Step 1: Output a Markdown Table**\n\n| Indicator                             | Prior Period | Current Period | YoY Change  |\n|---------------------------------------|--------------|----------------|-------------|\n| Net Cash Provided by Operating Activities | $28,848      | $36,150        | +25.3%      |\n| Net Cash Used in Investing Activities | $(8,564)     | $(16,194)      | -89.1%      |\n| Net Cash Used in Financing Activities | $(19,714)    | $(20,201)      | -2.5%       |\n| Free Cash Flow                        | $16,836      | $18,953        | +12.6%      |\n| Capital Expenditures (CapEx)          | $(12,012)    | $(17,197)      | -43.2%      |\n| Share Repurchases                     | $(15,696)    | $(15,068)      | +4.0%       |\n| Dividends Paid                        | $0           | $(2,434)       | — *(New)*   |\n| Net Change in Cash and Cash Equivalents | $445         | $(202)         | -145.4%     |\n\n**Step 2: Write 3 Bullet-Point Analyst Comments**\n\n- Alphabet Inc. demonstrated strong core cash generation with a 25.3% increase in net cash provided by operating activities, indicating robust operational performance and efficient working capital management.\n- The company significantly increased its capital expenditures by 43.2%, reflecting strategic investments in property and equipment, which may support future growth but also contributed to a substantial increase in cash used in investing activities.\n- Despite initiating dividend payments and maintaining substantial share repurchases, Alphabet's liquidity position slightly weakened, as evidenced by a net decrease in cash and cash equivalents, highlighting the impact of increased capital allocation activities on cash reserves.",
      "analysis_mdna": "- Alphabet's revenues increased by 12% year-over-year to $90.2 billion, driven by a 10% increase in Google Services and a 28% increase in Google Cloud revenues.\n- Operating income rose by 20% to $30.6 billion, with operating margins improving from 32% to 34%, primarily due to revenue growth outpacing cost increases.\n- Alphabet announced a $32 billion acquisition of Wiz, a cloud security platform, expected to close in 2026, which will enhance Google Cloud's security offerings.\n- The company repurchased $15.3 billion in shares during the quarter and increased its quarterly dividend by 5% to $0.21 per share, reflecting strong capital return to shareholders.\n- Google Cloud's operating income more than doubled, increasing by $1.3 billion, highlighting significant growth in infrastructure services and strategic focus on cloud expansion.",
      "file_title": "I'm ready to assist. Please provide the first page text of the company's 10-K or 10-Q SEC filing for me to process."
    }
  }
]