[
  {
    "extract_title": {
      "file_title": "I'm sorry, but I need the text from the first page of the company's 10-K or 10-Q SEC filing to generate the standardized file name. Please provide the text so I can assist you further.",
      "file_category": "Unknown"
    }
  },
  {
    "extract_10_Q": {
      "income_text": "Table of Contents\nMETA PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF INCOME\n(In millions, except per share amounts)\n(Unaudited)\nThree Months Ended March 31,\n2025 2024\nRevenue $ 42,314 $ 36,455\nCosts and expenses:\nCost of revenue 7,572 6,640\nResearch and development 12,150 9,978\nMarketing and sales 2,757 2,564\nGeneral and administrative 2,280 3,455\nTotal costs and expenses 24,759 22,637\nIncome from operations 17,555 13,818\nInterest and other income, net 827 365\nIncome before provision for income taxes 18,382 14,183\nProvision for income taxes 1,738 1,814\nNet income $ 16,644 $ 12,369\nEarnings per share:\nBasic $ 6.59 $ 4.86\nDiluted $ 6.43 $ 4.71\nWeighted-average shares used to compute earnings per share:\nBasic 2,527 2,545\nDiluted 2,590 2,625\nSee Accompanying Notes to Condensed Consolidated Financial Statements.\n7\nTable of Contents\nMETA PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(In millions)\n(Unaudited)\nThree Months Ended March 31,\n2025 2024\nNet income $ 16,644 $ 12,369\nOther comprehensive income (loss):\nChange in foreign currency translation adjustment, net of tax 893 (545)\nChange in unrealized gain (loss) on available-for-sale investments and other, net of tax 339 45\nComprehensive income $ 17,876 $ 11,869\nSee Accompanying Notes to Condensed Consolidated Financial Statements.\n8",
      "cashflow_text": "Table of Contents\nMETA PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n(Unaudited)\nThree Months Ended March 31,\n2025 2024\nCash flows from operating activities\nNet income $ 16,644 $ 12,369\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization 3,900 3,374\nShare-based compensation 4,147 3,562\nDeferred income taxes (993) (456)\nOther (231) 174\nChanges in assets and liabilities:\nAccounts receivable 2,804 2,520\nPrepaid expenses and other current assets 360 100\nOther assets (52) (94)\nAccounts payable (1,034) (1,112)\nAccrued expenses and other current liabilities (2,231) (1,274)\nOther liabilities 712 83\nNet cash provided by operating activities 24,026 19,246\nCash flows from investing activities\nPurchases of property and equipment (12,941) (6,400)\nPurchases of marketable securities (11,763) (6,887)\nSales and maturities of marketable securities 4,784 4,625\nOther investing activities (90) (72)\nNet cash used in investing activities (20,010) (8,734)\nCash flows from financing activities\nTaxes paid related to net share settlement of equity awards (4,883) (3,162)\nRepurchases of Class A common stock (12,754) (15,008)\nPayments for dividends and dividend equivalents (1,329) (1,273)\nPrincipal payments on finance leases (751) (315)\nOther financing activities 222 (9)\nNet cash used in financing activities (19,495) (19,767)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash equivalents 112 (288)\nNet decrease in cash, cash equivalents, and restricted cash equivalents (15,367) (9,543)\nCash, cash equivalents, and restricted cash equivalents at beginning of the period 45,438 42,827\nCash, cash equivalents, and restricted cash equivalents at end of the period $ 30,071 $ 33,284\nReconciliation of cash, cash equivalents, and restricted cash equivalents to the condensed consolidated\nbalance sheets\nCash and cash equivalents $ 28,750 $ 32,307\nRestricted cash equivalents, included in prepaid expenses and other current assets 71 84\nRestricted cash equivalents, included in other assets 1,250 893\nTotal cash, cash equivalents, and restricted cash equivalents $ 30,071 $ 33,284\nSee Accompanying Notes to Condensed Consolidated Financial Statements.\n10\nTable of Contents\nMETA PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n(Unaudited)\nThree Months Ended March 31,\n2025 2024\nSupplemental cash flow data\nCash paid for income taxes, net $ 448 $ 630\nCash paid for interest, net of amounts capitalized $ 352 $ 121\nNon-cash investing and financing activities:\nProperty and equipment in accounts payable and accrued expenses and other current liabilities $ 9,338 $ 4,217\nAcquisition of businesses and intangible assets in accounts payable, accrued expenses and other current\nliabilities, and other liabilities $ 159 $ 116\nRepurchases of Class A common stock in accrued expenses and other current liabilities $ 577 $ —\nSee Accompanying Notes to Condensed Consolidated Financial Statements.\n11",
      "mdna_text": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion of our financial condition and results of operations in conjunction with our condensed consolidated financial\nstatements and the related notes included elsewhere in this Quarterly Report on Form 10-Q and with our audited consolidated financial statements included in\nour Annual Report on Form 10-K for the year ended December 31, 2024, as filed with the Securities and Exchange Commission. In addition to our historical\ncondensed consolidated financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs. Our\nactual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to these differences include\nthose discussed below and elsewhere in this Quarterly Report on Form 10-Q, particularly in Part II, Item 1A, \"Risk Factors.\" For a discussion of limitations in\nthe measurement of our Family metrics, see the section entitled \"Limitations of Key Metrics and Other Data\" in this Quarterly Report on Form 10-Q.\nTo supplement our condensed consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting\nprinciples in the United States (GAAP), we present revenue on a constant currency basis, which is a non-GAAP financial measure. Revenue on a constant\ncurrency basis is presented in the section entitled \"—Revenue—Foreign Exchange Impact on Revenue.\" To calculate revenue on a constant currency basis, we\ntranslated revenue for the three months ended March 31, 2025 using the prior year's monthly exchange rates for our settlement or billing currencies other than\nthe U.S. dollar.\nThis non-GAAP financial measure is not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and\npresented in accordance with GAAP. This measure may be different from non-GAAP financial measures used by other companies, limiting its usefulness for\ncomparison purposes. Moreover, presentation of revenue on a constant currency basis is provided for year-over-year comparison purposes, and investors\nshould be cautioned that the effect of changing foreign currency exchange rates has an actual effect on our operating results. We believe this non-GAAP\nfinancial measure provides investors with useful supplemental information about the financial performance of our business, enables comparison of financial\nresults between periods where certain items may vary independent of business performance, and allows for greater transparency with respect to key metrics\nused by management in operating our business.\nExecutive Overview of First Quarter Results\nOur mission is to build the future of human connection and the technology that makes it possible.\nOur financial results and key Family metrics for the first quarter of 2025 are set forth below. Total revenue for the first quarter of 2025 was\n$42.31 billion, an increase of 16% compared to the first quarter of 2024, due to an increase in advertising revenue. Revenue on a constant currency basis would\nhave increased 19% compared to the first quarter of 2024. Ad impressions delivered across our Family of Apps in the first quarter of 2025 increased 5% year-\nover-year, and our average price per ad in the first quarter of 2025 increased 10% year-over-year.\nIncome from operations for the first quarter of 2025 was $17.56 billion, an increase of $3.74 billion, or 27%, compared to the first quarter of 2024,\ndriven by an increase in advertising revenue, partially offset by an increase in costs and expenses. The increase in costs and expenses was primarily due to\nincreases in employee compensation and infrastructure costs, partially offset by lower legal-related costs.\n27\nTable of Contents\nConsolidated and Segment Results\nWe report our financial results for our two reportable segments: Family of Apps (FoA) and Reality Labs (RL). FoA includes Facebook, Instagram,\nMessenger, WhatsApp, and other services. RL includes our virtual, augmented, and mixed reality related consumer hardware, software, and content.\nFamily of Apps Reality Labs Total\nThree Months Ended March 31, Three Months Ended March 31, Three Months Ended March 31,\n2025 2024 % change 2025 2024 % change 2025 2024 % change\n(in millions, except percentages)\nRevenue $ 41,902 $ 36,015 16% $ 412 $ 440 (6)% $ 42,314 $ 36,455 16%\nCosts and expenses 20,137 18,351 10% 4,622 4,286 8% 24,759 22,637 9%\nIncome (loss) from\noperations $ 21,765 $ 17,664 23% $ (4,210) $ (3,846) (9)% $ 17,555 $ 13,818 27%\nOperating margin 52 % 49 % (1,022)% (874)% 41 % 38 %\n• Net income was $16.64 billion, with diluted earnings per share (EPS) of $6.43 for the three months ended March 31, 2025.\n• Capital expenditures, including principal payments on finance leases, were $13.69 billion for the three months ended March 31, 2025.\n• Share repurchases of our Class A common stock were $13.40 billion and total dividend and dividend equivalent payments were $1.33 billion for the\nthree months ended March 31, 2025.\n• Cash, cash equivalents, and marketable securities were $70.23 billion as of March 31, 2025.\n• Effective tax rate was 9% for the three months ended March 31, 2025.\n• Headcount was 76,834 as of March 31, 2025, an increase of 11% year-over-year.\nFamily of Apps Metrics\n• Family daily active people (DAP) was 3.43 billion on average for March 2025, an increase of 6% year-over-year.\n• Ad impressions delivered across our Family of Apps in the first quarter of 2025 increased by 5% year-over-year.\n• Average price per ad in the first quarter of 2025 increased by 10% year-over-year.\nDevelopments in Advertising\nSubstantially all of our revenue is currently generated from advertising on Facebook and Instagram. We rely on targeting and measurement tools that\nincorporate data signals from user activity on websites and services that we do not control, as well as signals generated within our products, in order to deliver\nrelevant and effective ads to our users. Our advertising revenue has been, and we expect will continue to be, adversely affected by reduced marketer spending\nas a result of limitations on our ad targeting and measurement tools arising from changes to the regulatory environment and third-party mobile operating\nsystems and browsers.\nIn particular, legislative and regulatory developments such as the General Data Protection Regulation, including its evolving interpretation through\ndecisions of the Court of Justice of the European Union, ePrivacy Directive, European Digital Services Act, Digital Markets Act, and U.S. state privacy laws\nincluding the California Consumer Privacy Act, as amended by the California Privacy Rights Act, have impacted our ability to use data signals in our ad\nproducts, and an increasing number of laws have been introduced limiting or prohibiting the provision of our services to younger users. We expect these and\nother developments will have further impact in the future. As a result, we have implemented, and we will continue to implement, whether voluntarily or\notherwise, changes to our products and user data practices, which reduce our ability to effectively target and measure ads and may negatively impact our\nadvertising revenue and user engagement. For example, in response to regulatory developments in Europe, we announced our plans to change the legal basis\nfor behavioral advertising on Facebook and Instagram in the European Union, European Economic Area, and Switzerland from \"legitimate interests\" to\n\"consent,\" and began offering users in the region a \"subscription for no ads\" alternative. We subsequently began offering users in the region who elect to\ncontinue using our services free-of-charge, supported by ads, an option to see less personalized ads, which are less relevant and effective than our premium ad\nofferings. We are engaging with regulators on\n28\nTable of Contents\nour consent model. In addition, mobile operating system and browser providers, such as Apple and Google, have implemented product changes and/or\nannounced future plans to limit the ability of websites and application developers to collect and use these signals to target and measure advertising. For\nexample, in 2021, Apple made certain changes to its products and data use policies in connection with changes to its iOS operating system that reduce our and\nother iOS developers' ability to target and measure advertising, which has negatively impacted, and we expect will continue to negatively impact, the size of\nthe budgets marketers are willing to commit to us and other advertising platforms.\nTo mitigate these developments, we are continually working to evolve our advertising systems to improve the performance of our ad products. We are\ndeveloping privacy enhancing technologies to deliver relevant ads and measurement capabilities while reducing the amount of personal information we\nprocess, including by relying more on anonymized or aggregated third-party data. In addition, we are developing tools that enable marketers to share their data\ninto our systems, as well as ad products that generate more valuable signals within our apps. More broadly, we also continue to innovate our advertising tools\nto help marketers prepare campaigns and connect with consumers, including developing growing formats such as Reels ads and our business messaging ad\nproducts. Across all of these efforts, we are making significant investments in artificial intelligence (AI), including generative AI, to improve our delivery,\ntargeting, and measurement capabilities. Further, we are focused on driving onsite conversions in our business messaging ad products by developing new\nfeatures and scaling existing features.\nWe are also engaging with others across our industry to explore the possibility of new open standards for the private and secure processing of data for\nadvertising purposes. We believe our ongoing improvements to ad targeting and measurement are continuing to drive improved results for advertisers.\nHowever, we expect that some of these efforts will be long-term initiatives, and that the legislative, regulatory and platform developments described above will\ncontinue to adversely impact our advertising revenue for the foreseeable future.\nIn addition, we maintain advertising policies to protect the security and integrity of our platform and comply with global content, security, and integrity\nobligations. Our ongoing efforts to enhance enforcement against ads and marketers which violate our advertising policies adversely affect our revenue, and we\nexpect that the continued enhancement of such efforts will have an impact on our revenue in the future, which may be material.\nOther Business and Macroeconomic Conditions\nOther global and regional business, macroeconomic, and geopolitical conditions also have had, and we believe will continue to have, an impact on our\nuser growth and engagement and advertising revenue. In particular, we believe advertising budgets have been pressured from time to time by factors such as\ninflation, economic policies and international trade, high interest rates, and related market uncertainty, which has led to reduced marketer spending. We are\ncurrently subject to increased business, macroeconomic, and geopolitical uncertainty, including as a result of volatility around international trade, which could\nimpact our financial results in future periods.\nIn addition, competitive products and services have reduced some users' engagement with our products and services. We are investing in Reels and in AI\ninitiatives across our products, including our AI-powered discovery engine to recommend relevant content, which we have already seen results in improved\nuser engagement and monetization of our products. However, we continue to face competition from other products and services within certain demographics,\nin particular younger users. In addition, while Reels is growing in usage, it monetizes at a lower rate than our Feed and Stories products and we expect it will\ncontinue to monetize at a lower rate for the foreseeable future. We also have seen fluctuations and declines in the size of our active user base in one or more\nregions from time to time due to geopolitical conditions, which have adversely affected our user growth and engagement. These trends have adversely affected\nour advertising revenue and we expect will continue to adversely affect our advertising revenue in the foreseeable future.\nAlthough we regularly evaluate a variety of sources to understand trends in our advertising revenue, we do not have perfect visibility into the factors\ndriving advertiser spending decisions and our assessments involve complex judgments about what is driving advertising decisions across a large and diversified\nadvertiser base across the globe. Trends impacting advertising spend are also dynamic and interrelated. As a result, it is difficult to identify with precision\nwhich advertiser spending decisions are attributable to which trends, and we are unable to quantify the exact impact that each trend had on our advertising\nrevenue during the periods presented.\n29\nTable of Contents\nInvestment Philosophy\nWe remain focused on operating efficiently while investing in significant opportunities. In the three months ended March 31, 2025, 81% of our total\ncosts and expenses were recognized in FoA and 19% were recognized in RL. Our FoA investments include expenses relating to headcount, data centers, and\ntechnical infrastructure as part of our efforts to develop our apps and our advertising services. These efforts include significant investments in AI initiatives,\nincluding to recommend relevant content across our products, enhance our advertising tools, develop new products, and develop new features for existing\nproducts using generative AI. In particular, we expect our AI initiatives will require increased investment in infrastructure and headcount.\nWe are also making significant investments in our metaverse and wearables efforts, including developing virtual, augmented, and mixed reality devices,\nsoftware for social platforms, neural interfaces, and other foundational technologies. Our RL investments include expenses relating to technology development\nacross these efforts. Many of our RL investments are directed toward long-term, cutting-edge research and development for products that may only be fully\nrealized in the next decade. During the three months ended March 31, 2025, our RL segment reduced our overall operating profit by approximately\n$4.21 billion, and we continue to expect our full-year RL operating losses to increase in 2025. We expect this will be a complex, evolving, and long-term\ninitiative, and our ability to support our RL efforts is dependent on generating sufficient profits from other areas of our business. We are investing now because\nwe believe this will become the next computing platform and will unlock monetization opportunities for businesses, developers, and creators, including around\nadvertising, hardware, and digital goods.\n30\nTable of Contents\nTrends in Our Revenue by User Geography\nWe calculate our revenue by user geography based on our estimate of the geography in which ad impressions are delivered, virtual and digital goods are\npurchased, or consumer hardware products are shipped. The geography of our users affects our revenue and financial results. Our revenue in regions such as\nUnited States & Canada and Europe is relatively higher primarily due to the size and maturity of those online and mobile advertising markets, and ad\nimpression growth is mainly in geographies that monetize at lower rates, such as Asia-Pacific. In the first quarter of 2025, revenue increased by 18% in United\nStates & Canada, 14% in Europe, 13% in Asia-Pacific, and 20% in Rest of World, in each case relative to the same period in 2024.\n-\nAd Revenue Non-Ad Revenue\nNote: Non-advertising revenue includes RL revenue generated from the delivery of consumer hardware products and FoA Other revenue, which consists of revenue from WhatsApp Business\nPlatform, Meta Verified subscriptions, net fees we receive from developers using our Payments infrastructure, and revenue from various other sources.\nOur revenue by user geography in the charts above is geographically apportioned based on our estimation of the geographic location of our users when they perform a revenue-generating\nactivity. This allocation differs from our revenue disaggregated by geography disclosure in Note 2 — Revenue in our condensed consolidated financial statements included in Part I, Item 1,\n\"Financial Statements\" where revenue is geographically apportioned based on the addresses of our customers.\n31\nTable of Contents\nTrends in Our Family Metrics\nThe numbers for our key Family metrics, our DAP and average revenue per person (ARPP), do not include users on our other products unless they\nwould otherwise qualify as DAP based on their other activities on our Family products.\nTrends in the number of people in our community affect our revenue and financial results by influencing the number of ads we are able to show, the\nvalue of our ads to marketers, as well as our expenses and capital expenditures. Substantially all of our daily active people (as defined below) access our\nFamily products on mobile devices.\n• Daily Active People (DAP). We define a daily active person as a registered and logged-in user of Facebook, Instagram, Messenger, and/or WhatsApp\n(collectively, our \"Family\" of products) who visited at least one of these Family products through a mobile device application or using a web or mobile\nbrowser on a given day. We do not require people to use a common identifier or link their accounts to use multiple products in our Family, and therefore\nmust seek to attribute multiple user accounts within and across products to individual people. Our calculations of DAP rely upon complex techniques,\nalgorithms, and machine learning models that seek to estimate the underlying number of unique people using one or more of these products, including\nby matching user accounts within an individual product and across multiple products when we believe they are attributable to a single person, and\ncounting such group of accounts as one person. As these techniques and models require significant judgment, are developed based on internal reviews of\nlimited samples of user accounts, and are calibrated against user survey data, there is necessarily some margin of error in our estimates. We view DAP as\na measure of engagement across our products. For additional information, see the section entitled \"Limitations of Key Metrics and Other Data\" in this\nQuarterly Report on Form 10-Q.\n--\nNote: We report the numbers of DAP as specific amounts, but these numbers are estimates of the numbers of unique people using our products and are subject to statistical variances and\nerrors. While we expect the error margin for these estimates to vary from period to period, we estimate that such margin generally will be approximately 3% of our worldwide DAP. At our\nscale, it is very difficult to attribute multiple user accounts within and across products to individual people, and it is possible that the actual numbers of unique people using our products may\nvary significantly from our estimates, potentially beyond our estimated error margins. For additional information, see the section entitled \"Limitations of Key Metrics and Other Data\" in this\nQuarterly Report on Form 10-Q. Beginning in the fourth quarter of 2023, our Family metrics no longer include Messenger Kids users.\nWorldwide DAP increased 6% to 3.43 billion on average during March 2025 from 3.24 billion during March 2024.\n32\nTable of Contents\n• Average Revenue Per Person (ARPP). Our Family of Apps (FoA) revenue represents the substantial majority of our total revenue. We define ARPP as\nour FoA revenue during a given quarter, divided by the average of the number of DAP at the beginning and end of the quarter.\nARPP: $9.47 $10.42 $10.93 $12.33 $11.20 $11.89 $12.29 $14.25 $12.36\nNote: We updated our definition of ARPP beginning in the first quarter of 2024 and have recast ARPP in prior periods for comparative purposes.\nDuring the first quarter of 2025, worldwide ARPP was $12.36, an increase of 10% from the first quarter of 2024.\n33\nTable of Contents\nTrends in Our Ad Impressions and Average Price Per Ad\n• Ad Impressions. Our advertising revenue is generated by displaying ad products on Facebook, Instagram, Messenger, and third-party mobile\napplications. Impressions are considered delivered when an ad is displayed to a user.\n_\n_\nNote: Our ad impressions growth by user geography in the charts above is geographically apportioned based on our estimation of the geographic location of our users when an ad impression\nis delivered.\n34\nTable of Contents\n• Average Price Per Ad. We calculate average price per ad as total advertising revenue divided by the number of ads delivered.\n_\n_\nNote: Our average price per ad growth by user geography in the charts above is geographically apportioned based on our estimation of the geographic location of our users when an ad\nimpression is delivered.\n35\nTable of Contents\nComponents of Results of Operations\nRevenue\nFamily of Apps (FoA)\nAdvertising. We generate substantially all of our revenue from advertising. Our advertising revenue is generated by displaying ad products on Facebook,\nInstagram, Messenger, and third-party mobile applications. Marketers pay for ad products either directly or through their relationships with advertising\nagencies or resellers, based on the number of impressions delivered or the number of actions, such as clicks, taken by users.\nWe recognize revenue from the display of impression-based ads in the contracted period in which the impressions are delivered. Impressions are\nconsidered delivered when an ad is displayed to a user. We recognize revenue from the delivery of action-based ads in the period in which a user takes the\naction the marketer contracted for. The number of ads we show is subject to methodological changes as we continue to evolve our ads business and the\nstructure of our ads products. In particular, the ads we show may vary by product (for example, our video and Reels products are not currently monetized at the\nsame rate as our Feed or Stories products), and from time to time we increase or decrease the number or frequency of ads we show as part of our product and\nmonetization strategies. We calculate average price per ad as total advertising revenue divided by the number of ads delivered, representing the average price\npaid per ad by a marketer regardless of their desired objective such as impression or action. For advertising revenue arrangements where we are not the\nprincipal, we recognize revenue on a net basis.\nOther revenue. Other revenue consists of revenue from WhatsApp Business Platform, Meta Verified subscriptions, net fees we receive from developers\nusing our Payments infrastructure, and revenue from various other sources.\nReality Labs (RL)\nRL revenue is generated from the delivery of consumer hardware products, such as Meta Quest and Ray-Ban Meta AI glasses, and related software and\ncontent.\nCost of Revenue and Operating Expenses\nCost of revenue. Our cost of revenue consists of expenses associated with the delivery and distribution of our products. These mainly include expenses\nrelated to the operation of our data centers and technical infrastructure, such as depreciation expense from servers, network infrastructure and buildings,\nemployee compensation which includes payroll, share-based compensation and benefits for employees on our operations teams, and energy and bandwidth\ncosts. Cost of revenue also consists of costs associated with partner arrangements, including traffic acquisition costs and credit card and other fees related to\nprocessing customer transactions; RL inventory costs, which consist of cost of products sold and estimated losses on non-cancelable contractual commitments;\nand content costs.\nResearch and development. Research and development expenses consist mostly of employee compensation which includes payroll, share-based\ncompensation and benefits for our employees on our engineering and technical teams who are responsible for developing new technologies and products; RL\ntechnology development costs; infrastructure costs; and facilities-related costs.\nMarketing and sales. Marketing and sales expenses consist primarily of employee compensation which includes payroll, share-based compensation and\nbenefits for our employees engaged in sales, sales support, marketing, business development, and customer service functions; marketing and promotional\nexpenses; and professional services to support our community and product operations.\nGeneral and administrative. General and administrative expenses consist primarily of employee compensation which includes payroll, share-based\ncompensation and benefits for certain of our executives as well as our legal, finance, human resources, corporate communications and policy, and other\nadministrative employees; legal-related costs, which include estimated fines, settlements, or other losses in connection with legal and related matters, as well as\nother legal fees; other taxes, such as digital services taxes and other non-income-based tax levies; and professional services.\n36\nTable of Contents\nResults of Operations\nThe following table sets forth our condensed consolidated statements of income data (in millions):\nThree Months Ended March 31,\n2025 2024\nRevenue $ 42,314 $ 36,455\nCosts and expenses:\nCost of revenue 7,572 6,640\nResearch and development 12,150 9,978\nMarketing and sales 2,757 2,564\nGeneral and administrative 2,280 3,455\nTotal costs and expenses 24,759 22,637\nIncome from operations 17,555 13,818\nInterest and other income, net 827 365\nIncome before provision for income taxes 18,382 14,183\nProvision for income taxes 1,738 1,814\nNet income $ 16,644 $ 12,369\nThe following table sets forth our condensed consolidated statements of income data (as a percentage of revenue)(1):\nThree Months Ended March 31,\n2025 2024\nRevenue 100 % 100 %\nCosts and expenses:\nCost of revenue 18 18\nResearch and development 29 27\nMarketing and sales 7 7\nGeneral and administrative 5 9\nTotal costs and expenses 59 62\nIncome from operations 41 38\nInterest and other income, net 2 1\nIncome before provision for income taxes 43 39\nProvision for income taxes 4 5\nNet income 39 % 34 %\n____________________________________\n(1) Percentages have been rounded for presentation purposes and may differ from unrounded results.\n37\nTable of Contents\nRevenue\nThe following table sets forth our revenue by source and by segment:\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nAdvertising $ 41,392 $ 35,635 16 %\nOther revenue 510 380 34 %\nFamily of Apps 41,902 36,015 16 %\nReality Labs 412 440 (6)%\nTotal revenue $ 42,314 $ 36,455 16 %\nFamily of Apps\nFoA revenue in the three months ended March 31, 2025 increased $5.89 billion, or 16%, compared to the same period in 2024. The increase was almost\nentirely driven by advertising revenue.\nAdvertising\nAdvertising revenue in the three months ended March 31, 2025 increased $5.76 billion, or 16%, compared to the same period in 2024, due to increases\nin ad impressions delivered and average price per ad. During the three months ended March 31, 2025, ad impressions delivered increased by 5%, year-over-\nyear, as compared with a 20% increase in the same period in 2024. Ad impressions delivered during the three months ended March 31, 2025 grew in all\nregions, especially in Asia-Pacific, which was primarily driven by increases in users and their engagement on our products. During the three months ended\nMarch 31, 2025, the average price per ad increased by 10%, year-over-year, as compared with an increase of 6% in the same period in 2024. The increase in\naverage price per ad during the three months ended March 31, 2025 was driven by an increase in advertising demand, which we believe is mostly due to\nongoing improvements to our ad performance from our ad targeting and measurement tools. This increase was partially offset by a higher number of ad\nimpressions delivered, especially in geographies and in products, such as Reels, that monetize at lower rates. Other factors are discussed in the section entitled\n\"—Executive Overview of First Quarter Results.\" In addition, the online commerce vertical was the largest contributor to the increase in advertising revenue in\nthe three months ended March 31, 2025 compared to the same period in 2024. We anticipate that future advertising revenue will be driven by a combination of\nprice and ad impressions delivered.\nOther revenue\nFoA other revenue in the three months ended March 31, 2025 increased $130 million, or 34%, compared to the same period in 2024. The increase was\nmostly driven by revenue from WhatsApp Business Platform and Meta Verified subscriptions.\nReality Labs\nRL revenue in the three months ended March 31, 2025 decreased $28 million, or 6%, compared to the same period in 2024. The decrease in RL revenue\nwas driven by a net decrease in Meta Quest sales, partially offset by an increase in sales of Ray-Ban Meta AI glasses.\nForeign Exchange Impact on Revenue\nChanges in foreign exchange rates had an unfavorable impact on our revenue in the three months ended March 31, 2025 compared to the same period in\n2024. To calculate revenue on a constant currency basis, we translated revenue using the prior year's monthly exchange rates for our settlement or billing\ncurrencies other than the U.S. dollar. Using these constant rates for the three months ended March 31, 2025, our total revenue and advertising revenue would\nhave been $43.55 billion and $42.62 billion, which were $1.24 billion and $1.22 billion higher than actual total revenue and advertising revenue, respectively.\n38\nTable of Contents\nCost of revenue\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nCost of revenue $ 7,572 $ 6,640 14 %\nPercentage of revenue 18 % 18 %\nCost of revenue in the three months ended March 31, 2025 increased $932 million, or 14%, compared to the same period in 2024. The increase was\nmainly due to higher operational expenses related to our data centers and technical infrastructure, which included a decrease in the depreciation growth rate due\nto an extension in the useful lives of servers and network assets, effective January 1, 2025. To a lesser extent, higher costs associated with partner arrangements\nalso contributed to the increase in the three months ended March 31, 2025.\nSee Note 1 — Summary of Significant Accounting Policies in the notes to the condensed consolidated financial statements included in Part I, Item 1, of\nthis Quarterly Report on Form 10-Q for additional information regarding changes in the estimated useful life of our servers and network assets.\nResearch and development\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nResearch and development $ 12,150 $ 9,978 22 %\nPercentage of revenue 29 % 27 %\nResearch and development expenses in the three months ended March 31, 2025 increased $2.17 billion, or 22%, compared to the same period in 2024.\nThe increase was mostly due to higher employee compensation and infrastructure costs for research and development.\nThe higher employee compensation was mainly from a 14% growth in employee headcount from March 31, 2024 to March 31, 2025 in engineering and\nother technical functions supporting our continued investment in our family of products and Reality Labs.\nMarketing and sales\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nMarketing and sales $ 2,757 $ 2,564 8 %\nPercentage of revenue 7 % 7 %\nMarketing and sales expenses in the three months ended March 31, 2025 increased $193 million, or 8%, compared to the same period in 2024. The\nincrease was mainly due to an increase in professional services related to ongoing platform integrity efforts.\n39\nTable of Contents\nGeneral and administrative\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nGeneral and administrative $ 2,280 $ 3,455 (34)%\nPercentage of revenue 5 % 9 %\nGeneral and administrative expenses in the three months ended March 31, 2025 decreased $1.18 billion, or 34%, compared to the same period in 2024.\nThe decrease was primarily driven by lower legal-related costs.\nSee Note 8 — Commitments and Contingencies in the notes to the condensed consolidated financial statements included in Part I, Item 1, of this\nQuarterly Report on Form 10-Q for additional information regarding legal-related costs.\nSegment profitability\nThe following table sets forth income (loss) from operations by segment:\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nFamily of Apps $ 21,765 $ 17,664 23 %\nReality Labs (4,210) (3,846) (9)%\nTotal income from operations $ 17,555 $ 13,818 27 %\nFamily of Apps\nFoA income from operations in the three months ended March 31, 2025 increased $4.10 billion, or 23%, compared to the same period in 2024. The\nincrease in FoA income from operations was driven by higher advertising revenue which was partially offset by an increase in costs and expenses. The increase\nin costs and expenses was mainly due to increases in employee compensation and infrastructure costs, partially offset by a decrease in legal-related costs.\nReality Labs\nRL loss from operations in the three months ended March 31, 2025 increased $364 million, or 9%, compared to the same period in 2024, driven by an\nincrease in RL costs and expenses. RL costs and expenses increased primarily due to an increase in employee compensation.\nSee Note 8 — Commitments and Contingencies, and Note 11 — Segment Information in the notes to the condensed consolidated financial statements\nincluded in Part I, Item 1, of this Quarterly Report on Form 10-Q for additional information regarding legal-related costs and segment employee compensation,\nrespectively.\n40\nTable of Contents\nInterest and other income, net\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nInterest income $ 658 $ 585 12 %\nInterest expense (240) (127) (89)%\nForeign currency exchange gains (losses), net 232 (148) 257 %\nOther income, net 177 55 222 %\nTotal interest and other income, net $ 827 $ 365 127 %\nInterest expense increased in the three months ended March 31, 2025, compared to the same period in 2024, due to higher long-term debt balances.\nForeign currency exchange gains (losses), net increased in the three months ended March 31, 2025, compared to the same period in 2024, as a result of foreign\ncurrency transactions and remeasurement. Other income, net recognized in the three months ended March 31, 2025, was primarily related to unrealized gains\non our equity investments.\nProvision for income taxes\nThree Months Ended March 31,\n2025 2024 % change\n(in millions, except percentages)\nProvision for income taxes $ 1,738 $ 1,814 (4)%\nEffective tax rate 9 % 13 %\nOur provision for income taxes in the three months ended March 31, 2025 decreased $76 million, or 4%, compared to the same period in 2024, due to a\ndecrease in the effective tax rate, offset by an increase in income before provision for income taxes.\nOur effective tax rate decreased in the three months ended March 31, 2025 compared to the same period in 2024, a majority of which was due to excess\ntax benefits recognized from share-based compensation.\nEffective Tax Rate Items. Our effective tax rate in the future will depend upon the proportion between the following items and income before provision\nfor income taxes: U.S. tax benefits from foreign-derived intangible income, tax effects from share-based compensation, research tax credit, tax effects from\ncapital losses not expected to be utilized, settlement of tax contingency items, tax effects of changes in our business, and the effects of changes in tax law.\nThe accounting for share-based compensation may increase or decrease our effective tax rate based upon the difference between our share-based\ncompensation expense and the deductions taken on our tax return, which depend upon the stock price at the time of employee award vesting. If our stock price\nremains constant to the April 25, 2025 price, and absent any changes to our tax landscape, we expect our effective tax rate for the full year 2025 to be in the\nrange of 12-15%. This includes the effects of the mandatory capitalization and amortization of research and development expenses incurred in 2025, as\nrequired by the 2017 Tax Cuts and Jobs Act (Tax Act). The mandatory capitalization requirement increases our 2025 cash tax liabilities materially but also\ndecreases our effective tax rate due to increasing the foreign-derived intangible income deduction. If the mandatory capitalization is deferred or repealed, our\neffective tax rate in 2025 could be higher when compared to current law and our cash tax liabilities could be lower.\nThe Tax Act included a reduction in the foreign-derived intangible income deduction for tax years beginning after December 31, 2025. Absent any\nchanges to U.S. tax law, the decrease in our U.S. tax benefits from foreign-derived intangible income would increase our cash tax liabilities and effective tax\nrate in 2026.\nA number of countries have enacted legislation to implement the Organization for Economic Cooperation and Development’s 15% global minimum tax\nregime. We do not expect these changes to have a material impact on our consolidated financial statements for 2025. We continue to evaluate the impacts of\nproposed and enacted legislation with respect to the global minimum tax regime in the jurisdictions we operate in. As additional jurisdictions enact legislation,\n41\nTable of Contents\ntransitional relief expires, and other provisions of the minimum tax legislation become effective, our effective tax rate and cash tax payments could increase in\nfuture years.\nSee Note 10 — Income Taxes in the notes to the condensed consolidated financial statements included in Part I, Item 1, of this Quarterly Report on Form\n10-Q for additional information regarding income tax contingencies.\nLiquidity and Capital Resources\nOur principal sources of liquidity are our cash, cash equivalents, marketable securities, and cash generated from operations. Cash, cash equivalents, and\nmarketable securities are comprised of cash on deposit with banks, time deposits, money market funds, U.S. government and agency securities, investment\ngrade corporate debt securities, and marketable equity securities. As part of our cash management strategy, we concentrate cash deposits with large financial\ninstitutions and our investment holdings are in diversified highly rated securities. Cash, cash equivalents, and marketable securities were $70.23 billion as of\nMarch 31, 2025, a decrease of $7.58 billion from December 31, 2024. The decrease was primarily due to our capital returns of $14.08 billion for repurchases of\nour Class A common stock and payments of dividends and dividend equivalents, $13.69 billion for capital expenditures, including principal payments on\nfinance leases, and $4.88 billion of taxes paid related to net share settlement of employee restricted stock unit (RSU) awards. These decreases were partially\noffset by $24.03 billion of cash generated from operations.\nThe following table presents our cash flows (in millions):\nThree Months Ended March 31,\n2025 2024\nNet cash provided by operating activities $ 24,026 $ 19,246\nNet cash used in investing activities $ (20,010) $ (8,734)\nNet cash used in financing activities $ (19,495) $ (19,767)\nCash Provided by Operating Activities\nCash provided by operating activities during the three months ended March 31, 2025 mostly consisted of $16.64 billion net income adjusted for certain\nnon-cash items, such as $4.15 billion of share-based compensation expense and $3.90 billion of depreciation and amortization expense. The increase in cash\nflows from operating activities during the three months ended March 31, 2025, compared to the same period in 2024, was due to an increase in cash collection\nfrom our customers driven by the increase in revenue, partially offset by higher operational spending.\nCash Used in Investing Activities\nCash used in investing activities during the three months ended March 31, 2025 mostly consisted of $12.94 billion of purchases of property and\nequipment as we continued to invest in servers, data centers, and network infrastructure, and $6.98 billion of net purchases of marketable securities. The\nincrease in cash used in investing activities during the three months ended March 31, 2025, compared to the same period in 2024, was mostly due to increases\nin purchases of property and equipment and marketable securities.\nWe anticipate making capital expenditures of approximately $64 billion to $72 billion in 2025 to support our core business and generative AI efforts.\nCash Used in Financing Activities\nCash used in financing activities during the three months ended March 31, 2025 mostly consisted of $12.75 billion for repurchases of our Class A\ncommon stock, $1.33 billion of payments of dividends and dividend equivalents, and $4.88 billion of taxes paid related to net share settlement of RSUs. The\nslight decrease in cash used in financing activities during the three months ended March 31, 2025, compared to the same period in 2024, was due to a decrease\nin share repurchases, partially offset by an increase in taxes paid related to net share settlement of RSUs.\n42\nTable of Contents\nMaterial Cash Requirements\nWe currently anticipate that our available funds and cash flow from operations and financing activities will be sufficient to meet our operational cash\nneeds and fund our investments in infrastructure and AI initiatives, share repurchases and dividend payments for at least the next 12 months and thereafter for\nthe foreseeable future. We continuously evaluate our liquidity and capital resources, including our access to external capital, to ensure we can finance our future\ncapital requirements.\nLeases and Contractual Commitments\nOur operating and finance leases include data centers, offices, certain network infrastructure and colocations. In addition to lease liabilities, we have\nleases that have not yet commenced of approximately $35.27 billion as of March 31, 2025, which will commence between the remainder of 2025 and 2034.\nWe also have $30.05 billion of contractual commitments as of March 31, 2025 primarily related to our investments in servers and network infrastructure,\nand content costs.\nLong-term Debt\nAs of March 31, 2025, we had outstanding long-term debt in the form of senior unsecured notes for an aggregate principal amount of $29.0 billion,\nwhich mature from 2027 through 2064. Short-term and long-term future interest payments obligations as of March 31, 2025 were $1.38 billion and\n$27.63 billion, respectively.\nCapital Return Program\nShare Repurchase\nOur board of directors has authorized a share repurchase program of our Class A common stock, which commenced in January 2017 and does not have\nan expiration date. During the three months ended March 31, 2025, we repurchased and subsequently retired 19 million shares of our Class A common stock\nfor an aggregate amount of $13.40 billion. As of March 31, 2025, $37.95 billion remained available and authorized for repurchases.\nDividend\nIn February 2025, we increased our quarterly cash dividends from $0.50 to $0.525 per share of Class A and Class B common stock. During the three\nmonths ended March 31, 2025, we paid $1.33 billion of dividends and dividend equivalents. Subject to legally available funds and future declaration by our\nboard of directors, we currently intend to continue to pay a quarterly cash dividend and dividend equivalents on our outstanding common stock.\nTaxes\nCash paid for income taxes was $448 million during the three months ended March 31, 2025. Subsequently, we also made a $3.72 billion U.S. federal\nincome tax payment in April 2025, which included the final installment payment of $718 million related to a one-time transition tax payable incurred as a result\nof the Tax Act.\nOur long-term income taxes include $10.92 billion related to the uncertain tax positions as of March 31, 2025. Due to uncertainties in the timing of the\ncompletion of tax audits, the timing of the resolution of these positions is uncertain and we are unable to make a reasonably reliable estimate of the timing of\npayments.\nLoss Contingencies\nWe are involved in legal proceedings, claims, and regulatory, tax or government inquiries and investigations. Significant judgment is required to\ndetermine both probability and the estimated amount of loss. Such matters are inherently unpredictable and subject to significant uncertainties, some of which\nare beyond our control. Should any of these estimates and assumptions change or prove to be incorrect, it could have a material impact on our results of\noperations, financial position, and cash flows.\n43",
      "title_page_text": "UNITED STATES\nSECURITIES AND EXCHANGE COMMISSION\nWashington, D.C. 20549\n____________________________________________\nFORM 10-Q\n____________________________________________\n(Mark One)\n☒ QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the quarterly period ended March 31, 2025\nor\n☐ TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934\nFor the transition period from to\nCommission File Number: 001-35551\n____________________________________________\nMeta Platforms, Inc.\n(Exact name of registrant as specified in its charter)\n____________________________________________\nDelaware 20-1665019\n(State or other jurisdiction of incorporation or organization) (I.R.S. Employer Identification Number)\n1 Meta Way, Menlo Park, California 94025\n(Address of principal executive offices and Zip Code)\n(650) 543-4800\n(Registrant's telephone number, including area code)\n____________________________________________\nSecurities registered pursuant to Section 12(b) of the Act:\nTitle of each class Trading symbol(s) Name of each exchange on which registered\nClass A Common Stock, $0.000006 par value META The Nasdaq Stock Market LLC\nIndicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 (Exchange Act) during the preceding\n12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes ☒ No ☐\nIndicate by check mark whether the registrant has submitted electronically every Interactive Data File required to be submitted pursuant to Rule 405 of Regulation S-T (§232.405 of this chapter)\nduring the preceding 12 months (or for such shorter period that the registrant was required to submit such files). Yes ☒ No ☐\nIndicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, a smaller reporting company, or an emerging growth company. See the definitions\nof \"large accelerated filer,\" \"accelerated filer,\" \"smaller reporting company,\" and \"emerging growth company\" in Rule 12b-2 of the Exchange Act.\nLarge accelerated filer ☒ Accelerated filer ☐\nNon-accelerated filer ☐ Smaller reporting company ☐\nEmerging growth company ☐\nIf an emerging growth company, indicate by check mark if the registrant has elected not to use the extended transition period for complying with any new or revised financial accounting\n☐\nstandards provided pursuant to Section 13(a) of the Exchange Act.\nIndicate by check mark whether the registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes ☐ No ☒\nIndicate the number of shares outstanding of each of the issuer's classes of Common Stock, as of the latest practicable date.\nClass Number of Shares Outstanding\nClass A Common Stock $0.000006 par value 2,171,148,098 shares outstanding as of April 25, 2025\nClass B Common Stock $0.000006 par value 343,179,151 shares outstanding as of April 25, 2025"
    }
  },
  {
    "get_analysis_requirements": {
      "income_requirements": null,
      "cashflow_requirements": null,
      "mdna_requirements": "Focus on any guidance from the management"
    }
  },
  {
    "analyze_sections": {
      "analysis_income": "### Step 1: Markdown Table\n\n| Indicator                     | Prior Period | Current Period | YoY Change   |\n|-------------------------------|--------------|----------------|--------------|\n| Net Income                    | $12,369      | $16,644        | +34.5%       |\n| Comprehensive Income          | $11,869      | $17,876        | +50.6%       |\n| Other Comprehensive Income    | $(500)       | $1,232         | — *(New)*    |\n\n### Step 2: Analyst Comments\n\n- **Profitability Trends**: Meta Platforms, Inc. demonstrated a strong profitability trend with a significant 34.5% increase in net income year-over-year, driven by higher revenue and effective cost management.\n  \n- **Capital Return Strategies**: The data provided does not include specific figures for stock repurchases or dividends paid, indicating a potential area for further investigation into the company's capital return strategies.\n\n- **Changes in Balance Sheet Strength or Equity**: The substantial increase in comprehensive income, up by 50.6%, suggests improved balance sheet strength, largely due to positive changes in foreign currency translation adjustments and unrealized gains on investments.",
      "analysis_cashflow": "**Step 1: Output a Markdown Table**\n\n| Indicator                                | Prior Period | Current Period | YoY Change  |\n|------------------------------------------|--------------|----------------|-------------|\n| Net Cash Provided by Operating Activities| $19,246      | $24,026        | +$4,780     |\n| Net Cash Used in Investing Activities    | $(8,734)     | $(20,010)      | -$11,276    |\n| Net Cash Used in Financing Activities    | $(19,767)    | $(19,495)      | +$272       |\n| Net Change in Cash and Cash Equivalents  | $(9,543)     | $(15,367)      | -$5,824     |\n| Capital Expenditures (CapEx)             | $(6,400)     | $(12,941)      | -$6,541     |\n| Share Repurchases                        | $(15,008)    | $(12,754)      | +$2,254     |\n| Dividends Paid                           | $(1,273)     | $(1,329)       | -$56        |\n\n**Step 2: Write 3 Bullet-Point Analyst Comments**\n\n- **Core Cash Generation**: The company demonstrated strong cash generation from operations, with a 24.8% increase in net cash provided by operating activities, driven by higher net income and adjustments for non-cash items like depreciation and share-based compensation.\n\n- **Capital Allocation**: There was a significant increase in capital expenditures, more than doubling from the prior period, indicating substantial investment in property and equipment. Despite this, the company reduced its share repurchases by $2.25 billion, suggesting a shift in capital allocation priorities.\n\n- **Liquidity Position**: The net decrease in cash and cash equivalents widened by $5.82 billion compared to the previous year, primarily due to increased investing activities. This suggests a more aggressive investment strategy, potentially impacting short-term liquidity.",
      "analysis_mdna": "- **Revenue Growth and Drivers**: Total revenue for Q1 2025 increased by 16% year-over-year to $42.31 billion, primarily driven by a 16% increase in advertising revenue, with ad impressions up 5% and average price per ad up 10%.\n\n- **Profitability and Cost Management**: Income from operations rose by 27% to $17.56 billion, despite increased costs in employee compensation and infrastructure, offset by reduced legal-related expenses. The operating margin improved to 41% from 38% in the previous year.\n\n- **Capital Allocation and Investments**: Significant capital expenditures of $13.69 billion were made, with a focus on AI and infrastructure. Additionally, $13.40 billion was allocated to share repurchases, and $1.33 billion to dividends, reflecting a strong capital return strategy.\n\n- **Strategic Developments and Risks**: The company is investing heavily in AI and Reality Labs, with the latter incurring a $4.21 billion operating loss. Regulatory changes, particularly in Europe, are impacting ad targeting and measurement, potentially affecting future advertising revenue.\n\n- **Geographic Revenue Trends**: Revenue growth was strongest in the Rest of World at 20%, followed by the United States & Canada at 18%, indicating robust performance across diverse markets despite challenges in ad monetization in lower-rate regions like Asia-Pacific."
    }
  }
]